{"meta":{"title":"爱探索的小T同学:Tikas","subtitle":"","description":"一个致力于推荐冒险岛更好的游戏体验网站，由斗鱼主播Tikas创建，提供新人如何玩台服新枫之谷、萌新知识、解锁教程、装备打造搭配、活动攻略、游戏内容等周边","author":"Tikas","url":"https://xtikas.com","root":"/"},"pages":[{"title":"创作之余的唠叨之地","date":"2021-01-24T15:54:36.269Z","updated":"2021-01-24T15:54:36.269Z","comments":false,"path":"about/index.html","permalink":"https://xtikas.com/about/index.html","excerpt":"","text":""},{"title":"","date":"2020-09-14T05:37:23.705Z","updated":"2020-09-14T05:37:23.705Z","comments":true,"path":"404.html","permalink":"https://xtikas.com/404.html","excerpt":"","text":"404 很抱歉，您访问的页面不存在 可能是输入地址有误或该地址已被删除 页面丢失了，5秒后跳转回首页 setTimeout(\"javascript:location.href='https://xtikas.com'\", 5000); $(function(){ var wait= 5; time(wait); }); function time(wait) { $(\"#time\").html(\"\"+wait+\"\"); wait--; setTimeout(function() { time(wait); }, 1000); }"},{"title":"","date":"2020-05-31T22:06:06.000Z","updated":"2021-02-22T15:06:17.093Z","comments":true,"path":"dailian/index.html","permalink":"https://xtikas.com/dailian/index.html","excerpt":"","text":"金 牌 代 练 业内金牌口碑的代练 没有谁比我们自己更注重口碑，同样，也没有谁比您自己更在乎账号安全！诚信：让我们彼此合作。 金牌口碑服务： 安全：纯手动代练，在两年里服务了众多账号 专业：众多满级 275等级的角色，可见的专业级别 低效：我们没有外挂的高效。所以：不敢称高效 团队：团队配合，我们不是一个人 实惠：虽然价格不是最低，但是，实惠却是实情 我们的团队成员： Tikas 直播间 我很好奇 直播间 泡芙小姐姐 直播间 Diunashen 江木川柯南 香菜 浮云孤飞 主要业务范围承接台服冒险岛新枫之谷代练服务，练级等相关耗时的工作交给我们，助您解放双手，享受生活，享受游戏。 代练方面： 1-140等级的Link练级 1-200等级的联盟练级 140-200等级的联盟练级 200-275满级的冲级 非艾丽亚区不承接哦！ BOSS前置方面： 斯乌：黑色天堂 黛米安：枫叶英雄 库洛斯：十字旅团本部 浓姬：武田信玄的联络 梅格耐斯：支援夺回本部 西格诺斯：被破坏的弓箭手村-谣言 其他比如狮子王的前置，因性价比不高就不接啦 相关活动及日常： 神秘河的日常相关 活动的日常相关 代练价格200级内价格以下的代练价格，都是不包含商城的双倍经验卡的，如果需要，我们会以每个角色另收 5元。 建议自备乐豆点，因为如果练 140 的 Link 号，在同职业的情况下，一张商城双可以练 2个号，虽然练 200级，有的需要 2张 商城双。但是，整体算下来，还是自备乐豆点会省些钱。 当然，每个职业群需要配一个宠物哦，这样会方便我们练级。 如果想知道那些职业是商城通用的，可以点这里：点我查阅台服冒险岛新枫之谷 link 图 具体如下： 包创建角色（需要二级密码及取名规则） 包角色职业新手前置 包做 HD 蓝双 不包含商城双 不包每个职业群的一个宠物 价格如下： 1-140级的 Link 价：50元/个1-200级的 联盟 价：200元/个140-200级的 联盟 价：150元/个 当然，每个角色配对有蓝双，相应的每张蓝双减 5元。 比如练一个 Link，有两张蓝双，这样，这个 Link 就只收 40元了，当然，练一个 Link 一般只需要 2张 蓝双就可以了，再多可能会造成浪费。 Link、联盟的套餐价格 A）主号搭配 12 个 Link 主号可以选择 1-200级，外加 12 个 140 级的 link 号，这样等于刚来台服冒险岛新枫之谷，就可以直接主号链满 link 啦！价格如下：主号 1-200级：200元12个 140级的 Link：600元总价格：800元优惠价：700元，立省：100元自备 500点乐豆点 就差不多了（购买商城双和宠物用） B）6000 联盟 由于联盟最高级，只能出征 40 个角色，所以，6000 联盟可以这样搭配：6 个 200 级 + 34 个 140 级这样搭配，是比较合理的。其中，主号在 6个 200 级里，另外 5个 200级的号，可以选择角色卡加成属性好的职业，这样的 6000 联盟是战斗力最强的，加成属性也是最高的！这样总联盟有：5960，距离 6000 联盟差 40级。没事，我们白送这 40 级！在 34 个 的 140 级里，我们会额外每个角色多升一级，或者两级，以补全这额外的 40级。价格如下：6个 200级：1200元34个 140级：1700元总价格：2900元优惠价：2380元，立省：520元自备 1500点乐豆点 就差不多了（购买商城双和宠物用）如果你是有大号的，并且大号等级是大于 200级，那么，我们只需要练 5 个 200 级，就可以了。这样总价格只需要 2180元。非常实惠。 C）8000 联盟 同样的，由于联盟最高级，只能出征 40 个角色，这里就直接按 40个 200级来算：40个 200级 总价格：8000元40个 200级 优惠价：6200元，立省：1800元自备 2500点乐豆点 就差不多了（购买商城双和宠物用）同样的道理，如果你有一大号大于 200等级 了，那么，我们只需要练 39 个 200级。这样价格只需要 6000元。非常实惠。 D）原 6000联盟，升 8000 联盟 排除一个大号 200 等级以上的，如果您的 6000 联盟是我们这练的，应该还有 5个 200级的，这样，我们只需要计算 34 个 140-200 级的价格就可以了。如果您的号是别人练的，也许可能是 39 个 150 级的 link 角色，这样的情况，我们依旧是计算 39 个 140-200 级的价格，:(方案一：34个 140-200级 总价格：5100元34个 140-200级 优惠价：4200元，立省：900元方案二：39个 150-200级 总价格：5850元39个 150-200级 优惠价：4800元，立省：1050元 200级-250级的价格由于最新新出了艾戒道具，这样经验加成更高了！ 如果您能经验拉满，除非是非常没效率的职业，不然，我们只会按小时收费，这样可以避免您多出更多的代练费用！ 经验拉满如：商城双、蓝双、三经验宠、经验戒指、公园药、经验药、Link、联盟，像苦行和经验吊坠等等这些能有更好！ 当然号上最好有轮烧啦，不然，挂轮会很麻烦。 具体收费为： 30元/小时 当然，您也可以参照没出艾戒之前的等级收费（除非您的职业练级很没效率，不然不会采取这种收费方式！）： 200 级 - 210 级：15元/级 210 级 - 220 级：30元/级 220 级 - 230 级：60元/级 230 级 - 235 级：120元/级 235 级 - 240 级：150元/级 240 级 - 250 级：300元/级 250级后的价格从 250级 开始，就没有商城的经验加倍卡了，所以，价格相应涨了，这时候任何能提升经验获取的都成了必备品，比如前面所说的苦行和经验吊坠等这些经验加成道具。 具体价格如下：35元/小时 当然，您也可以参照没出艾戒之前的等级收费（除非您的职业练级很没效率，不然不会采取这种收费方式！）： 250 级 - 260 级：750元/级 260 级 - 270 级：1500元/级 270 级 - 275 级：3000元/级 BOSS 前置打包价格斯乌、黛米安、库洛斯、浓姬、梅格耐斯、西格诺斯，这六个一起打包价：号上有轮：230元号上无轮：260元 日常相关价格神秘河的日常，为每天: 20元/天，这是六个球的日常任务。 如果您每少一个球，对应价格就减少：2元。 如果您有轮有无限飞，那么价格就再减少：2元。 活动相关的其他费用，就按时价来收了，具体要看活动情况了。 如何合作原本我们也采用过练完再收钱的，2019年发生过一起号主跑路事故，让团队小伙伴们非常伤心。 现在起，都是采用先钱再练的原则，对此带来不便，非常抱歉！ 如果您是练 200级以后的等级，可以采用日结方式。 如果您是练 250级以后的等级，可以采用周结方式。 联系方式您可以通过 QQ 来和我取得联系： QQ：87182380 或者直接点击下面链接，同我在线 QQ 交流： 使用 QQ 在线和 Tikas 交流http://wpa.qq.com/msgrd?v=3&uin=87182380&site=qq&menu=yes 当我们进一步合作之时，会邀请您进我们的小圈子 QQ 群：1145108175 安全建议为了您的账号安全，建议您可以在代练前，修改一个简单的密码给我们；代练完之后，再次修改一个新的复杂密码。如非必要，请不要告诉我们您的二级密码！ 付款方式由于个人最近忙于品牌策划，如果您需要我们的代练服务，请加我个人 QQ：87182380，说明来意，然后我会把您推荐给小伙伴们。 如何付款，需要您同小伙伴们进行沟通。 以我品德口碑向您声明： 小伙伴们不会收钱跑路，给您带来损失将由我赔付。 贵重装备请上锁，如果没上锁的丢失也是我们来赔付。 一定要记得代练完之后修改密码！！！ 如果您在国内，可以使用下面扫码方式付款： 支付宝 扫码支付 微信 扫码支付 如果您在国外，可以加我的支付宝好友： 支付宝账号：87182380艾特QQ.com 图文介绍"},{"title":"听说打赏我的人，都进了福布斯排行榜(๑ºั╰╯ºั๑)","date":"2019-12-31T17:01:01.000Z","updated":"2021-01-13T15:30:18.133Z","comments":false,"path":"donate/index.html","permalink":"https://xtikas.com/donate/index.html","excerpt":"","text":"如果本站对您有所帮助，请打赏 —— 1元就足够感动我！😋如果您的打赏不想出现此页面中，请用 QQ 联系我，不然，我会以打赏的时间进行排列，并公布在此页面。 如果您在任何时候，想要回这笔打赏，请提供打赏的订单号相关信息发给我，我会把您的打赏退回给您，并且，并不会去掉本页面里的打赏记录 此处应有打赏感谢认可！ 打赏榜： &nbsp; &nbsp; &nbsp; AZHI 68元 summer 5.20元 虎牙肆月旋律【接代练】 8.88元 二彼 5.20元 溜溜 0.50元 &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; 以上排名只按打赏统计时间排序,最后更新于：2021-01-13 如果您的打赏没有出现在上面表格中，请用 QQ 联系我 请只在本站内的打赏二维码进行打赏！ 非本站的二维码，可能会有人冒充！ QQ在线交流 如果您想要回这笔打赏，请提供打赏的相关信息发给我，我会把您的打赏退回给您 打赏方式（暂停接受打赏） 支付宝 扫码打赏 微信 扫码打赏"},{"title":"","date":"2019-12-17T04:29:05.000Z","updated":"2021-03-19T01:54:53.612Z","comments":true,"path":"link/index.html","permalink":"https://xtikas.com/link/index.html","excerpt":"","text":"本页面为台服冒险岛新枫之谷最新 Link 传授图页面，跟随最新版本，请收藏此面以查阅最新 Link 传授图！ 长期更新（最近更新阿戴尔，更新于:2020-06-17） 点我直接查看最新 Link 传授大图https://cdn.jsdelivr.net/gh/tikas/cdn/blog/link/link-05.png"}],"posts":[{"title":"离心式洗号——揭秘岁城离心不为人知的事实","slug":"C有道心T有离心","date":"2021-01-10T08:02:01.000Z","updated":"2021-02-22T15:59:27.140Z","comments":true,"path":"secret-lixin.html","link":"","permalink":"https://xtikas.com/secret-lixin.html","excerpt":"","text":"岁城离心，真名：谢啟鑫，目前是 QQ群：337971357 群主，斗鱼直播间号为：875191，目前使用的 QQ 号为：544055641，已知使用两个支付宝。 本文会有少量个人点评，但纯属撰写真实事件，揭秘岁城离心不为人知的事实。 一、起源从国服刚刚来到台服的离心，同不少的萌新都一样，什么都不懂。 一切的开端，就从离心租轮时，遇到了柯南。 那时的离心，对装备不了解，对职业不了解，对练级方法也同样不了解！ 好心的柯南，带着 link 套和花轮，一把鼻涕一把尿教离心怎样快速练级，还手把手教导了很多枫之谷这游戏的相关知识点。 不可置否，柯南是离心的枫之谷导师。 二、柯南带着离心走进代练在 2019年年中，柯南同离心发起了接点代练来做，以赚点外快。他们两人一起出钱买了一个燃烧之戒。 当时说好了是 7：3 分，离心找客户拿 3成，柯南打号拿 7成（那时离心依旧还是不会高效练级，但是已经不属于萌新了）。离心拿 3成，是要负责挂花轮的。 基本上是直播打号，打了没几个单子之后，就发起了建立一个 QQ交流群（现在离心的交易群前身），邀请了当时所有斗鱼直播的主播。 如：好奇，百川，黑童话等等，当然也还有我在内。 一直持续了两个月之后，柯南就回去上班了。由于上班之后，只能晚上打打号，效率低了好多，柯南就开始逐渐放弃代练。 那时的离心，就开始做一些代卖和代买，主要都是走 8591 的。 三、柯南的首次退谷由于柯南晚上练号到半夜，影响到了第二天上班，柯南就决定不再代练，link 装备 和 柯南的账号都留给了离心（号上有轮烧，烧是一人出一半钱），然后让离心再找个伙伴一起做代练。 那时的离心是找了我来做伙伴。 之后柯南在回归之前便再也没上过游戏。 四、离心式洗号，一切从群主身份开始由于离心是群主，这导致了很多人依附他，给予了他很多便利。 而这，也是离心式洗号的开始，他把很多群友给予的便利，当成自己的，直接贩卖变现，整个过程，原主是一点都不知情。 如果不是柯南之后的回归，一堆的人被蒙在鼓里。 五、柯南的回归，让事件开始崭露头角2020年年初，由于疫情原因，这让许多的人以游戏打发时间，而柯南，也在 3月份 回归枫之谷。 然而！轮和烧，以及 link 套，全没了，仅剩下一个仅有联盟的 “空号” 而已。 也是这个月，柯南开始了长达 9个月 的装备讨回之路。 柯南一定想不到，已经 2021年的艾比活动结束了，依旧是没能讨回所有的装备（这都是后话） 六、更多人的装备，在原主不知情的情况下，被离心贩卖由于离心是群主关系，已经借过很多人的 link 套、轮回等道具，并且，都是隐瞒原主，直接贩卖。 七、从2020年7月开始，困难时期的离心，我给了他一些帮助知道离心已经贩卖了很多人的装备，急需要钱进行偿还的他，在他最需要的时候，安排了两个满级的号进行排班，再怎么说，当时也是他拉我来代练的。 做人要懂得感恩。 由于我深刻知晓代练不易，所以，所有的价格都是没有进行抽成的，比如，一小时 35元，就能拿到手有 35元（我一直以来志不在此，而是想让小伙伴们能拿到不被抽成的劳动费）。 点我查看最后一次安排表https://docs.qq.com/sheet/DTG9RU3NuTFd6Y0py?tab=BB08J2 八、拉黑离心，从他有钱不还开始安排了两个号，从7月到9月，虽然中间有断过半个月，期间他还自己接了一些单练，怎么说也有 2W 进账。 然而，依旧欠着这些被他贩卖装备的钱。 我对自己拉黑他的评价是： 他是一个不懂得感恩的人，他的所作所为让我很难过。 九、2020年12月，公开了这场完整的吃瓜事件链接: https://pan.baidu.com/s/1Mog_VeGqyvfowlqEKS3GHA 提取码: 5ves","categories":[{"name":"吃瓜","slug":"吃瓜","permalink":"https://xtikas.com/categories/%E5%90%83%E7%93%9C/"}],"tags":[]},{"title":"多招教你防护自己的账号，让你在新枫之谷不用担心盗号","slug":"防盗安全知识","date":"2020-06-09T14:02:09.000Z","updated":"2021-01-20T15:19:34.252Z","comments":true,"path":"anti-theft.html","link":"","permalink":"https://xtikas.com/anti-theft.html","excerpt":"最近收到好几个小伙伴的来信，说自己的新枫之谷被洗号了！一度怀疑是缤放的问题。 什么！ 这损失也太大了！！！ 所以，小T同学决定，撰写一篇安全相关的文章给大家，好让更多小伙伴的账号更安全！","text":"最近收到好几个小伙伴的来信，说自己的新枫之谷被洗号了！一度怀疑是缤放的问题。 什么！ 这损失也太大了！！！ 所以，小T同学决定，撰写一篇安全相关的文章给大家，好让更多小伙伴的账号更安全！ 一、知彼知已，才能有效防范人们常说：知己知彼，百战不殆。 我们首先要知道盗号者常用的手段，针对这些进行防护，让自己的安全防护等级提高一阶。 所以，我们需要先 “知彼” ！ 先去了解盗号者常用手段。 盗号者要想盗号，他们会想尽办法拿到你的相关密码，常见的手段有： A、通过受害者的电脑端操作这类盗号属于比较低难度的手段。但是，由于受害者轻视，往往会最直接快速进行盗号。 他们会想尽办法把捆绑盗号的程序传递给受害者。 如： 1、群内上传的文件 2、网盘的文件 3、一些破解程序 4、一些非法网站 5、邮件传播 6、直接发送文件 等等 这类的文件，一般正常些的杀毒软件都会进行拦截，当然盗号者也会进行做免杀处理。 见招拆招，以下习惯可以有效防范这些盗号手段： 1、使用专业的杀毒软件，而非国内打着“安全”旗号却整天推广广告的软件 2、不轻信别人发来的文件 3、远离破解程序 4、养成良好的上网习惯，不要访问一些 X 网站 5、系统请使用微软正版系统，并保持更新，可以从微软官网和 msdn itellyou 下载镜像，PE 系统可以选择：微PE 6、开启 UAC，别关了用户账户控制！ B、通过中间人进行网络监视操作这种情况，比上面的手段就要高多了，技术层次也是。 他们常用的手段有： 1、通过你的电脑代理接管，进行分析网络密文（如：伪装成加速器或者本身就是加速器） 2、入侵路由，接管路由后，全面监控所有数据（这种类似 WIFI） 3、网路上层拦截（这种数据量太大，除非明文传输，不然，没人会去分析这海量的数据） 其他等等 这类的方式，除了第一种是在本地的，其他的都不是本地能防范的。 由于中间人并没有进行键盘记录等操作，所以，他们看到的密码信息是加密后的信息。 见招拆招，一起学习下面招式： 1、为网络上不同的网站使用不同的密码，并且密码要复杂些，长度长些，加大密码被破解的时间，并做好不定期修改密码。 2、不使用不安全的加速器 3、不使用不安全的路由器（比如某某路由器已经爆出重大漏洞了，还没进行修补） C、尝试弱口令或社工库密码猜解很多人有着账号统一、密码统一的坏习惯，以方便自己记忆。 却不知！ 这会让盗号者有更多的发挥空间！ 首先，盗号者会猜想你的账号，你以为很难吗？ 错了！ 他们只需要进群里，就能轻易猜测你的账号，因为群里的人 百分之八九十 的账号都是 QQ 邮箱！ 这也是目前最多账号被盗的原因！ 请大家一定要使用全新的密码，并且不易被猜测的！ 看看您是否也处于线上资料外泄事件之中 检测自己的信息是否有泄漏 如果上面没有外泄，请别大意，你可以找找相关社工库检查一下，自行谷歌 or 百度吧！ 防范这种盗号的招式，前面已经有说，加强自身密码复制强度，以及，别过于统一！ 文章后文写 “知己” 部分，会有教大家如何创建复杂的密码！ D、攻破游戏数据库，直接拿号好吧，这已经不是玩家的事了，不过，橘子的数据库应该不会同网易之前那样明文记录吧…？ 防范方法也只有加强密码复杂程序了。 E、终极盗号只需一秒，你是这情况吗？这是压箱子的方法，也是最简单的，同样，也是最快速的！ 只需一秒是夸张了点，其效果没有任何夸大！ 那就是：自己把密码信息告诉别人！ 这多是以下情况： 1、代练 2、好友 3、代卖等中介托管等 防范方法： 代练别贪小便宜，现在很多低价的都是外挂代练，号没了就损失大了！贵重物品上锁放仓库，二级密码别泄漏，代练前改个简单的密码，代练过后请更改密码。 好友请选择信得过的，同样，多一人知道密码就增加被盗风险，请你的好友的电脑一样要保持安全。 代卖等中介托管，依旧一样要选择可信任的！ 如果你的朋友把二级密码都给你了，请好好珍惜！ 二、知已知底，有恃无恐前面所说这么多，无非就是知晓盗号者的一些手段，虽然不全面，但是已经囊括了八九成了，豪不夸张的说：防范得当，安全系数飙升数倍。 然而，人总是有弱点可攻破的，自己的安全系数再高，如果犯了前面最后一条，依旧等同虚设。 所以 我们需要再 “知已”，把最后的一两成系数补全，以达到理想化的绝对安全（世界上没有绝对安全的电脑，然而我们却可以把安全系数提高到理论上的绝对安全） 让我们一起来减少人为的因素吧！ A、重要的账号信息能开两步验证，就一定开！什么是两步验证？ 他是即使你的账号密码被外泄了，别人拿不到第二步验证，也是一样无法进行盗号。 新枫之谷的扫码登录准确地说：并不是两步验证！ 因为如果盗号者能拿到你的手机，一扫就进入游戏了，这并没有进行第二重验证。 但是 很多重要的账号都已经支持两步验证了，比如苹果ID、相关邮箱等等。 如果你还没使用两步验证，不妨从现在起，开始使用吧！ B、创建自己特有的密码记忆体简单统一的密码，只要一个被攻破，就等于全部被攻破。 我们为每个账号都设置不一样的复杂密码，这能让自己的安全系数提高数倍。 但是，网上账号那么多，怎么去记这么多密码呢？ 先看我是怎么创建复杂的密码： xTxgQTG74As 假装自己网站的密码 上面的密码，试问，如果你是盗号者，能看得出规律吗？ 那么，读者你呢？ 小朋友，你是不是有很多问号呢？ 请再看下面一组密码： hKxgQTG74Un 假装游戏的港号密码 如果你只看到这个密码，是否也是看不出什么名堂来，除了前面的 hK 能看含意。 我们比对一下这两个密码，他们都有一串：xgQTG74 这就是密码记忆体！ 前后是取网站的前后字母，进行大小化组合。 这样自己就能在不同的网站使用：前缀 + 密码记忆体 + 后缀 来组合密码了！ 如何创建自己的密码记忆体呢？ 前面使用的 xgQTG74 其实是这样的一句话：西瓜抢图狗74 这样就很好记了，因为西瓜抢我的图很恶劣，我要到处抢回他的图。还因为抢回他的同时，抢错人了，导致另一个西瓜粉转黑了，太难了。 当然 生活中总得来些美好的。 比如 xgNZ6! 简单的记忆体：西瓜你最六 + 符号 如果没有灵感，你可以从生活中的一些美好事物里发现： 比如一首最爱的歌曲缩写比如最爱的爱人相关信息缩写等等 去尝试组合一下自己的复杂又好记的密码记体吧！ 创建的复杂密码，长度最好能有 16位 以上，这样能更有效的防止别人破译！ —- 重要信息，请记好笔记！ C、使用密码管理器为自己的不同账号分配随机密码上面创建密码记忆体的方法，毕竟有规律可寻，要是被有心人知晓自己的密码记忆体加密方式，依旧会有危害到其他网站账号风险。 那么，有没有我只需记住一个复杂的密码记忆体作为钥匙，去打开里面记录的其他随机高强度的密码呢？ 答案是有的！ 使用这个方法，建议先给自己的账号分级： 重要的如支付宝、银行、QQ、微信等和金钱相关的，请为每个设置另一个复杂的记忆体进行加密 其他相对重要的又常需要输入的密码，可以使用另一种记忆体进行加密 次要的可以使用密码管理器直接随机密码 1.强大的 Keepass 开源本地密码管理器keepass 是开源的本地密码管理器，可以使用一个主密钥或者密钥文件来锁定。数据库使用当前最为安全的 AES 和 Twofish 进行加密。 官网：http://keepass.info/ | 其他多国语言文件下载 由于所有的密码都记录在一个数据库里，使用时，请做好定时备份，以免因为数据库丢失，导致所有密码也丢失！ 建议配合相关网盘进行同步，以达到定时备份的效果。 2.更好用的 Lastpass 云密码管理器这是我一直在使用着的，非常好用，不管是在同步方面，还是在浏览器的扩展插件方面，都是非常好用，有过两次数据库被泄露，官方回应称非常有信心无法被破解。 官网：https://www.lastpass.com/zh Lastpass 支持两步验证，也支持类似密保卡编号的方式辅助验证，还有其他加强安全方面的，可以说非常到位了！ 免费版的同样功能强大，你只需记住一个复杂强大的主密码，其他的都交给 Lastpass 来管理密码吧！ 三、构建安全的本地系统环境，养成良好的上网习惯这里会着重讲如何加强系统安全，以及怎样提高自己的安全上网行为，期待爆料吧！ 待更新…","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"},{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"}]},{"title":"新人联盟成长指南-全方位解读助您在台服冒险岛新枫之谷快速升级。","slug":"新号如何快速起步","date":"2020-03-15T14:05:32.000Z","updated":"2021-03-14T18:12:18.317Z","comments":true,"path":"newbie-growth-guide.html","link":"","permalink":"https://xtikas.com/newbie-growth-guide.html","excerpt":"对于台服冒险岛新枫之谷的联盟实力，本文从两方面去解读新人如何快速成长，一是花钱，另一个是不花钱！","text":"对于台服冒险岛新枫之谷的联盟实力，本文从两方面去解读新人如何快速成长，一是花钱，另一个是不花钱！ 一、职业前置解读在台服冒险岛新枫之谷里，有着许多来自不同阵容的职业，他们有的可以直接从老家出来锻炼成长，有些却一定要完成老家的剧情任务，才能出来外面探险。 而更多的几乎是在 10级，就能在头顶提示一个灯泡任务：“〔教学〕来了解回家卷轴吧”，这是来自 “枫之谷GM” 给予勇士的 “回城卷轴”。 只要能在 10级完成这个任务，拿到 10张 回城卷轴，就不归纳在 “一定要完成老家的剧情任务” 里了。 在这里，小T同学已经为大家罗列出来，那些职业是在10级以后，还是要一定做完剧情任务，或者达到一定条件才能出来探险的职业： 来自 “超新星” 的 卡蒂娜（国服：魔链影士） 来自 “雷普族” 的 伊利恩（国服：圣晶使徒） 来自 “雷普族” 的 亚克（国服：影魂异人） 凯内西斯（国服：超能力者），出来魔法密林就可以了 来自 “英雄团” 的 隐月 以上需要做完老家的前置任务，才能出来探险哦！ 神之子需要完成第二章剧情之后，才能出来探险取得经验！ 另外，还有许多，不用做完，直接在 10级完成人物头顶上灯泡任务，领取 “枫之谷GM” 给予勇士的 “回城卷轴”，就可以出来探险啦！ 常见的有： 剑豪 阴阳师 虎影 开拓者 阿戴尔 等等… 有些职业不需要全部做完，比如： 来自 “英雄团” 的 幻影，拿到经验药瓶喝完就可以离开了。 来自 “达恩维尔” 的 幻兽师（国服：林之灵），只需要解锁四个形态就可以离开新手村了。 更多后续补充吧。。。 新角色，建议都保存一遍发型和脸型打开装备栏在装备栏里 点击 “SALON”分别在发型和脸型空白地方，点一下 “储存” 二、Link练号顺序建议新号由于没有联盟属性支撑，前期，建议先练以下三个号到 120级（或者 140级），增加一些属性和伤害 如果您的 Link 装攻击高，可以直接想练什么就练什么 第一个职业： “末日反抗军” 阵容的 “恶魔复仇者”2 级 link 传授是：伤害 +10% 第二个职业： “晓之阵” 阵容的 “剑豪”2 级 link 传授是：全属性 + 25，攻击力 + 15 第三个职业： “晓之阵” 阵容的 “阴阳师”2 级 link 传授是：伤害 +10% 以上三个职业，可以为后期 link 传授到 +20% 伤害，+25 点全属，+15 点攻击力，可以说非常不错了。 由于再多练加成属性的 link 传授会托慢进度，接下来，可以练三个经验加成的，进一步提高后续的成长速度。 第一个经验加成： “英雄图” 阵容的 “狂狼勇士（国服：战神）”2 级 link 传授是：连击宝珠经验 +650% 第二个经验加成： “英雄图” 阵容的 “龙魔导士（国服：龙神）”2 级 link 传授是：符文持续时间 +50% 第三个经验加成： “英雄图” 阵容的 “精灵游侠（国服：双弩精灵）”2 级 link 传授是：经验值获得量 +15% 有了三个基础属性加成，和三个经验加成，后续再练其他职业就轻松快捷多了 更多 link 传授可查阅：点我查阅台服冒险岛新枫之谷 link 图 如果前期新号没 link 装，建议先练到 70级，获取 1级 link传授 三、花钱成长钱要怎么花，这是一门学问，新人刚入谷，如果是花钱流，联盟的成长，又可以分为两个：一是找别人代练，二是自己练。 千万不要去购买别人账号！由于账号都是绑定个人信息，别人随时可以找回！ 1.花钱找人代练2.花钱自己练3.睿智葫芦升级方法优点是可以省时间，缺点是没能亲自去体验升级过程 价格一般是： 6000联盟 2500元左右（不含商城双的大概 100元钱，以及最好为四个大职业群各配一个宠物，也就是四个宠物大概 50元） 8000联盟就要贵些，大概 8000元左右（同样也是不含商城双，一个号大概两张商城双就够了） 如果是直接开练 6000联盟 以上的，不用考虑蓝双（非商城的双倍），代练会帮签到 Happy Day 换取蓝双。 在这里说声，如果不是特别急，不建议杀宠物换取蓝双，毕竟这代价太大了！自己买轮回碑石和燃烧之戒给工具号（另外注册一个号，一般拿林之灵或者主教来当工具人） 再收购 Link 装和联盟装，自己慢慢练。 这个好处是，轮回碑石基本上是大号必备品，属于必买品，燃烧也不错，这两个加起来可能就要用掉 2000-5000元（价格因市场因素决定）。 Link 装上的卷不同，价也不同，一般是按一套多少攻来算钱，法装便宜些，物理和法师各一套，总价格大概在 1500-2000之间（价格因市场因素决定） 联盟装就要分不同职业了，五大职业群，都要备一套，成本高，可以考虑租凭。 这里成本投入近万元，好处是体验了各职业的特色和练级，并且，投入的后期可以转手出售，算是 “零成本”，只花了自己的时间。如果你有 “睿智葫芦” 道具，你可以选择一个 200等级以上的角色做为导师，吸满同等级的 10W 个怪物数量（不一定要自己打），就可以给小号使用啦！ 注：导师角色等级一定要大于 200等级！ 小号使用时，只需要升级到 50等级，就可以直接从 50级 升到 200级 啦！ 不管是自己练还是请别人代练，下面的练级方法多看看，也是有好处的 当然 自己练的话，就能更有效率去练等级了 常规练级指导非常规练级指导# 15-40 在小青蛇渡过 前期可以在 “堕落城市（CMS：弃废都市）” 的 “沼泽地” 练小青蛇渡过到 40级 如果你的装备不够给力，可以在魔法密林打独眼怪到 25级，再回来这里练级 # 40-60 在土龙渡过 40-60级可以在 “奇幻村（CMS：林中之城）” 的 “沼泽：宁静的沼泽” 练土龙过渡到 60级 如果你的 Link 装不足以秒怪的情况下，建议在这里升级到 62 级，再去三转，三转之后，去沙漠升级到 73级，之后直接去下面玛迦提亚城的隐藏地图：闲人勿入 # 60-86 在沙漠渡过 三转之后，如果您没有趁手的武器，可以先到 “纳希沙漠” 的 “纳希绿洲城” 里找一个 “渣伊德” 的武器商人，可以购买到很多职业的 60级武器。 之后可以在沙漠的 “日落之路” 练级。 其中：“沉睡沙漠” 和 “萨赫勒地区2” 都是地形平坦，他们之间的区别是： 沉睡沙漠地图小，正常怪物数量：13个 萨赫勒地区2地图一般，正常怪物数量：15个 # 86-112 在天空之巢Ⅱ渡过 “神木村” 的 “天空之巢Ⅱ” 又简称 “鸟2”， 是最轻松的星图练级地方，对装备的星力要求不高，只需要：五颗星。并且能得到很多的经验值，非常不错！ 小技巧：你可以升级到 111等级，经验在 85%-95% 之间，这样子过去小火狗一到 112等级，就可以爆一下，其他等级的也适用. # 112-140 在小火狗渡过 在 “冰原雪域” 的 “试炼的洞穴1”里，这是一个很好的练级地方，如果职业很容易掉血，可以在中间泡熔浆来规避怪物的攻击。 # 140-160 在星光之塔渡过 坐落在 “维多利亚岛” 的 “星光之塔”，每年都接受到许多冒险家们的青睐。最受欢迎的是 “2楼咖啡厅” 以及 “5楼化妆品店”。 在这里冒险勇士们可以很快成长到 160-180级，建议实力强的职业，160级就可以离开星光之塔了，如果实力弱的职业，可以在这里享受多一些。 # 160-180 在外星人渡过 地球防御本部外面的 UFO飞船，拥有着非常多的外星人。其中，UFO 内部的走廊 H01 更是时时刻刻都能看到许多冒险家们，这里的外星人攻击非常高，建议要有良好的装备条件再来这里冒险。 如果你的职业并没有什么冷却快的全屏群攻技能，那么，这里升级到 200 等级是最好的选择。 # 180-200 在黄昏的勇士之村渡过 “时间神殿” 有三个门，其中一个叫 “未来之门” 里有个 “黄昏的勇士之村”，里面有两个地方是非常好的练级地方。 被遗弃的挖掘地区2练级神图，怪物集中，非常多冒险家在此出入 荒郊野外一个被大家快遗忘的地方，如果你在挖2没有图，不如来这里试试看 只需要到达 199级，经验值在 47% 就可以停下来！去做左边灯泡里 190级的任务（来自新村庄的信件），一直对话般做下去，不用三分钟，就可以到达 200级————重要提示，请记笔记！信息来自斗鱼主播：**我很好奇0v0**这里前期主要是走首领通道，中间多是不变的，最后一级我准备有时间测试 BOSS 的经验加成 所以，请大家等待更新吧！ 怎么去玛迦提亚城的隐藏地图？很简单，打开世界地图，在当前的地图里找到 “研究所C-2区”，点击出现坐标图标之后，点世界地图的上面 “登记路指南”，如下图所示： 来到 “研究所C-2区”，在左上角的小地图里从左边数，进第二个门，就可以到达隐藏地图：“闲人勿入” 了，如下图所示： 四、不花钱成长虽然不推荐这么肝，如果可以，您可以选择租 link 套和租轮回来练，这样花费小。 首先，要知道，这里不是国服，所以，我们要走一条强化之路，自强不息！ 新号前期需要打野捡装备，捡咒文的痕迹，以方便自己快速成长，并且有一定资金和咒文的痕迹，可以更方便下一个号的速成。 这里以练 6 个小号到 70 级，取得 1级 link 传授 从第 7 个号开始，为自己所选的大号（本尊主号），这样，当大号到达 80 级时，可以开启联盟！ 一、首个角色前期积累二、前期职业快速到 70级三、主号快速到达 200级 10级出来去 “弓箭手村” 右边的 “芽孢山丘”，接绿菇菇悬赏标示牌，完成任务取得：耳环装备 10-25 在 “魔法森林” 的 “北部森林：绿树的藤条” 打风独眼兽。记得要捡的东西：药水、装备、咒文的痕迹，前面两个可以回城拿去卖钱，这样可以快速积累资金 需要准备的装备：1、0-18级的 帽子，购买价：3800，7次强化2、0-18级的 上衣，购买价：8500，7次强化3、0-18级的 裤子，购买价：8000，7次强化4、0-18级的 鞋子，购买价：4000，5次强化5、0-18级的 手套，购买价：4000，5次强化6、0-18级的 耳环，任务取得，5次强化7、自带的 10级 武器，7次强化 如果打野能捡取到，就可以省下，不用去城里购买（没有自己的防具装备，可以去维多利亚港购买通用的）每次强化需要1个咒文的痕迹，强化5星需要大概 8000游戏币 如果强化 20级以上的装备，每次强化，将需要 2个咒文痕迹！ 需要准备的游戏币和咒文的痕迹游戏币最好能有：12万，以防装备需要去购买，或者咒文痕迹不够时，好去拍卖购买咒文的痕迹最好有 43个，可以通过击败精英怪快速获取。后续不够，可以通过拍卖购买，一个大概 3000游戏币 达到 20级，优先给武器强化，并上满 5星。 强化只需要 100% 咒文的痕迹，手套可能只有 70% ，就强化 70%概率的。 之后有 4万左右游戏币，就去 菇菇神社 购买 5分钟的 攻击药水。 角色没有 100级，前往菇菇神社方法 首先回到城里，在左上角的小地图下面点击快速移动到售票处，和移动小帮手对话就能去菇菇神社啦！ 在菇菇神社里找到 “章鱼烧厨师：健二” 购买对应的 5分钟 攻击药水 物理：加量章鱼烧，每个 4200 魔法：双份日式炒面，每个 3800 之后，可以通过 “水晶” 回到 “弓箭手村” 有了攻击药水，接下来，就尽量把帽子、上衣、裤子、鞋子、手套、耳环等部位都强化 100% 咒文的痕迹并且上满5星 进入成长阶段！ 以上为第一个号所要准备的，后续其他小号，可以前期通过仓库转移资金和痕迹，提前准备新号前期第一个号，一切都是从零开始，所以，起步会比较难后续练其他小号时，可以把第一个号的物资通过仓库转移以方便小号前期提前做装备，进入成长阶段前期联盟小号，主要以快速到达 70级为主 故，这里先暂时介绍 70级内的练级方法 # 10-15级 在魔法森林-和天空临近的地方 刷 蝴蝶精 由于出来新手村需要去 “弓箭手村” 右边的 “芽孢山丘” 做任务拿耳环，拿到之后，可以直接过来这里刷蝴蝶精快速到 15级 # 15-30级 在魔法森林 的北部森林 里刷 风独眼兽 这里开始，尽量有装备、药水、咒文的痕迹，就捡，装备满了就回城卖，等级到 20级，就强化武器，之后可以慢慢补全其他部位。 30级二转之后，一定要有装备，有攻击药，没有请去菇菇神社购买。 # 30-40级 在堕落城市 的沼地：沼泽地 里刷 小青蛇 由于攻击并不是很充足，请一定要保持 5分钟的攻击BUFF 不会断，以加快清怪速度 记得有点数要用，加攻的被动先点满。 # 40-69级 完成三个主题副本：妖精学院、黄金海岸、里艾娜海峡 从 40级 开始，快速完成这三个副本，出来可以达到 69级 每完成一个副本，会得到一些装备奖励，缺少的装备或者更好，可以强化替换 # 69-70级 去60级指导的 “遗迹发掘地” 在这里完成三个 “遗迹发掘地布告栏” 的任务，就可以很快到达 70 级了。 键盘里没有 “指导” ？请按下面操作按 Esc 键，在弹出的菜单里选择 “安装快捷键” ，把 “指导” 拿到上面空白的按键里，保存退出。这样就能快速按两次那个按键，打开指导界面了。 快速开启联盟之路 从第二个号开始，就可以通过仓库，转移游戏币和咒文的痕迹了 这样 快速完成 6个 70级 的 link 小号 之后 从第 7个 号开始，练大号（本尊主号），这样，在达到 80级，就可以开启联盟啦！这里是为 71-200 级留下的，暂时还没写好，期待更新吧！ 五、联盟方阵知识点待更新…","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"使用LE启动台服冒险岛游戏-跳过缤放来启动新枫之谷游戏,不再卡死","slug":"使用LE启动游戏","date":"2020-03-13T05:27:14.000Z","updated":"2021-01-25T15:30:58.711Z","comments":true,"path":"launch-with-locale-emulator.html","link":"","permalink":"https://xtikas.com/launch-with-locale-emulator.html","excerpt":"最近缤放更新之后，总是会启动新枫之谷游戏之后，无法响应，或者，无法 “跳过 Play 视窗”，导致缤放需要结束进程。 很没体验感！ 使用 LE（Locale Emulator） 来直接启动台服冒险岛，可以免去上面所说的麻烦。 其实缤放自身已经使用 LE 模块来启动游戏的","text":"最近缤放更新之后，总是会启动新枫之谷游戏之后，无法响应，或者，无法 “跳过 Play 视窗”，导致缤放需要结束进程。 很没体验感！ 使用 LE（Locale Emulator） 来直接启动台服冒险岛，可以免去上面所说的麻烦。 其实缤放自身已经使用 LE 模块来启动游戏的 一、下载 LE 可以前往作者的网站找到下载地址：Locale Emulator作者网站 也可以直接从 Github 页面下载：Locale Emulator Github 下载页面在 Assets 里找到 Locale.Emulator.***.zip 二、安装 LE把下载回来的 Locale.Emulator.***.zip 文件解压出来，尽量存放的目录不能有中文，以免出错。 运行 LEInstaller.exe 分别点击 “Install for current user” 和 “Install for all users”,第二个可能会用户账户控制提示，请点是。 三、为新枫之谷配置 LE找到新枫之谷的游戏目录，找到 “MapleStory.exe” 应用程序，如下图： 在 “MapleStory.exe” 应用程序右键，选择 “Locale Emulator” 菜单里的 “修改此程序的配置” 接下来，设置预置配置为：中文（繁体，香港台湾都可以），时区就选（UTC + 08:00 北京….）就行 高级选项里记得勾选： 以管理员权限运行 伪造语言相关注册表键值 这样设置就可以了，记得点左上角的 “保存” 点保存之后会运行游戏（如果没有关闭用户账户控制会提示是和否，点否就行啦） 四、创建桌面快捷方式使用 LE 启动新枫之谷通过上面一步，游戏或许已经启动了，下次都这样启动游戏太麻烦了！ 别急着玩游戏！ 我们再来右键“MapleStory.exe” 应用程序，就是前面的一步 “修改此程序的配置”，这次进来不用修改，我们只是要点一下 “建立快捷方式” 这样桌面就有一个快捷启动的图标啦，以后就可以用他来启动游戏，如图： 如果使用 LE 启动游戏时，无法正常启动游戏，多数是之前台服冒险岛的进程没完全退出，请手动结束相关进程因为使用 LE 启动游戏，需要配合第三方缤放登录器来使用，这时也可以直接使用缤放来启动游戏，他会提示是否强制结束相关进程。缤放登录器从 3.1 版本开始，已经解决启动时卡死现象，这情况下，使用登录器启动游戏是最快捷的。后续的版本是否还会出现卡死情况，建议保留 LE 启动游戏。 五、相关链接Locale Emulator作者网站：杏爱会Locale Emulator Github：下载页面","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"Gash充值教程-必看篇","slug":"GASH充值","date":"2020-03-07T13:26:15.000Z","updated":"2021-03-14T18:12:22.782Z","comments":true,"path":"recharge-tutorial.html","link":"","permalink":"https://xtikas.com/recharge-tutorial.html","excerpt":"","text":"历经辛苦，终于来到了台服冒险岛新枫之谷的世界，这时候是不是很想购买商城里的宠物呢，让自己捡取道具可以解放一下双手。 千万别直接去宠物专区购买！这是一个骗局！ 这一切，都要从如何充值开始说起。 充值步骤 第 1/4 步，去淘宝购买 Gash 充值卡 要想充值新枫之谷的乐豆点（就是商城里使用的点卷啦），首先自己得有充值卡的 “充值码”，又叫 “储值密码”。您可以从万能的淘宝购买到，使用 “beanfun” 、“樂豆點” 、“GASH” 、“新枫之谷” 等关键词，去淘吧！现在市面流动的是 20位 和 21位 充值码（储值密码）。一般是 1元 等于 5点 ，购买大点数往往会有优惠，比如：GASH 1000点 的樂豆點，折算人民币是：200元，实际购买价一般会是在 190-200元 之间。（购买价会因市场变动而变动）因使用黑卡被锁，解锁账号条件是需要补回所有黑卡的点数！比如充值了一万元黑卡，解锁条件就是要再充值一万元卡才给解锁。有的 20位 充值码（储值密码）是黑卡！ —— 重要提示请记笔记！ 第 2/4 步，可选1：打开网页在线充值-充值之前 使用 “IE” 打开充值页面：台号 Beanfun 登录页面 | 港号 Beanfun 登录页面登录之后点击在我的钱包里的 “储值与购点”，如下图： 第 3/4 步，可选2：从缤放登录器里打开充值-充值之前 使用 “第三方缤放” 打开充值页面点缤放主界面的 “乐豆点” 菜单，选择 “储值与购点” 第 4/4 步，充值进行时 这里分开两种充值过程示例，第一个为台号，第二个为港号，默认显示是港号的充值过程如果需要查看台号的充值过程，请自己手动点击：“一、台号充值进行时”一、台号充值进行时二、港号充值进行时这里就以缤放登录器为例子进行介绍，网页的充值过程其实是一样的，大家可以访问官网进行尝试。点我前往台服冒险岛新枫之谷官网从缤放登录器里登录自己的台号后，在主界面的乐豆里可以找到充值入口：选择 “点数、礼物卡储值”：输入自己购买的储值卡，手机可以不用填写：储值成功（如果提示错误，可以尝试前面的乐豆卡储值）：回到主界面，刷新一下点数：结果如下：点充值 GASH 页面中间的 “台湾通用点数” ，会进入一个确认同意书页面，如下图：耐心等待，你将会发现新的页面会提示你输入 “储值密码” 进行储值。如果充值页面打不开，显示tls，一直反复跳网页等，请更换加速器或断开加速器试试输入购买来的正版 21位 充值码，手机不用填写，点 “进行储值” 吧！不一会，你将看到已经验证成功了的提示。也许网络原因会导致验证结果延迟，显示充值失败，不影响，不管充值成功与否，后去刷新一下点数吧！如上图，充值了 50 GASH点，外面显示乐豆：125点，游戏内显示 50点，这是因为：台号 10 GASH = 港号 25 GASH而大家只要知道游戏内多少点，就可以了，我们只需要记住台服冒险岛充值比例是：游戏内 5点 = 人民币 1元 正确的商城点数使用姿势！（重要！）当 GASH 点数充值成功时，是不是非常急不可耐去商城购买物品了，别急，下面这些信息对你来说非常重要！ 或许会帮你省下不少钱！ 1 坑害无数人的普通宠物购买专区！许多萌新在新枫之谷充值后第一件事就是去购买宠物，然而，却不知宠物里有一个坑！ 这就是外面的宠物栏显示的 100乐豆点 普通宠物（20元一个）。 为什么说他坑呢？ 因为这里的宠物无法交换成 “宠物硬币”！还更贵！ 真的太贵了！ 宠物硬币是一种消耗型硬币，双击他，可以换取一些非常实用的物品，具体宠物硬币交换物品清单如下图： 非常值得交换的物品有：1.经验值 2倍优惠卷（消耗 1个 宠物硬币）2.白金锤子（消耗 3个 宠物硬币，不建议换购，可以收艾比的白锤）3.宠物白金剪刀（消耗 4个 宠物硬币）4.永恒的生命水（消耗 5个 宠物硬币） 问：那么，既然这些 100乐豆点的普通宠物（20元一个）不能交换宠物硬币，那可以交换宠物硬币的宠物在那里购买呢？ 答：好问题！（感谢台胞 123321ruby 有问必答系列经典回复词） 在商城里的 “转蛋” 区里，有 “宠物随机箱” （单个 60点卷，12元），一次买十个的话就是 10元 一个宠物。 买宠物请认准宠物随机箱！ —— 重要提示请记笔记！ 只有相同的职业群，才能共用商城仓库！ 也就是说，在台服冒险岛新枫之谷里，同职业群，宠物角色共享的。 查看职业群大图：查看新台服冒险岛 link 图 商城里显示的宠物专区，是很贵又不能交换硬币的普通宠物（一个 20元），如下： 2 聪明的人才知道的 7折 优惠在商城消费时，除了里程商店里完全是 “免费” 购买物品，还能使用 “里程币” 在非里程商店进行 7折 优惠购买物品 只需要在购买物品时，勾选使用里程，就可以用一部份 “里程币” 代替 “乐豆点” 了，这是一件非常不错的省钱方法哦！ 并不是所有的商城物品都能以“里程点”代扣方式享受7折！ 后续会专门撰写关于 里程 的文章，敬请期待吧！ 相关链接beanfun：台号 Beanfun | 港号 Beanfun职业群大图：查看新台服冒险岛 link 图","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"},{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"}]},{"title":"台服冒险岛萌新职业推荐指南-如果您无法确定那个职业做大号不妨来看看","slug":"主号职业选择及新link图表","date":"2020-03-07T12:58:50.000Z","updated":"2021-03-14T18:11:36.374Z","comments":true,"path":"occupation-and-link.html","link":"","permalink":"https://xtikas.com/occupation-and-link.html","excerpt":"台服冒险岛游戏已经下载好了，账号也注册好了，该玩什么职业呢？职业排行靠前的并不是自己想要的，不用担心，Tikas 来帮你！","text":"台服冒险岛游戏已经下载好了，账号也注册好了，该玩什么职业呢？职业排行靠前的并不是自己想要的，不用担心，Tikas 来帮你！ 本文将进行重写，先把之前的折叠起来，如果你需要查阅，可以点我展开旧内容 一、认识枫之谷的五大职业分类随着新的职业不断呈现，更多的英雄们参于了黑魔法师的远征，这么多英雄体系，我们先来了解一下五大职业分类：战士：多以力量（STR）为主属性的职业，他们拥有高防御、高血量等特性，挑战 BOSS 时，往往是抗在前面的，往往带着：“只要我不倒下，队友就不会倒下！”的决意往前冲，然而，事实却是后排倒下了又倒下了~ 法师：以智力（INT）为主属性的职业，他们会玩火、玩冰、玩光、玩空间、玩召唤等，这是会玩的职业体系，然而，由于自己太会玩，往往会把自己玩的飘起来，属于弱势群体，其中主教又是一大特点，能抗能奶能输出，在黑魔法的远征队里很受大家的欢迎~ 弓箭手：以敏捷（DEX）为主属性的职业，他们拥有非常敏捷的身法，箭术更是高超，远程能力上比起法师来说利害太多了，是主流远程输出职业之一。 盗贼：以运气（LUX）为主属性的职业，拥有超高的回避，天生就有远超常人飘逸身手，由于过于注重攻击，自身防御实在太低，能否回避生来靠运气吃饭，近身容易飘。重氪之后能抗能打能生存，是队伍里主要的输出职业之一。 海盗：多以力量和敏捷为主属性的职业，杰诺（尖兵）更是有着三属性，这一体系的职业各有特点，但是多数并不是很容易上手，导致在枫之谷世界并没有大量的玩家群。 通过上面介绍，我们对枫之谷的各大职业分类有所了解了，然而，职业还是太多了，不知道怎么去定自己的主号，下面，就让 Tikas 来告诉你，选择主号的三大要素：1、机动性要灵活的2、能输出靠前面的，或者能爆发很高的3、不要法师主号的选择，机动性当然要灵活呐，不然，想躲避一些致命技能时，因为腿短，而躲避不及时就囧大了，输出方面当然要在所有职业里靠前，或者能爆发很高很高的那种，这样就很适合做主号啦！不要法师的原因是：法师职业在后期很难玩，除非是主教那样，能抗能奶能输出的职业，很适合帮助队友。 以上面三条为选择大号原则，适合的职业还是有很多的，建议配合自己的氪金量、BOSS定位去搭配，这样才更好些。二、职业推荐想玩职业，首先要知道自己打算投入多少，也就是氪多少，一般氪金都有下面几个层次： 0氪：字面上的意思，就是在游戏里不花钱。 微氪：我把 2000 元内的定义为微氪。 轻氪：2千-1万 定义为轻氪。 中氪：1万-5万 定义为中氪。 重氪：5万以上的定义为重氪。 以上定义，只是 Tikas 的个人定义，这定义，适合本站所有对应的氪金程度，不由每个人自身能力去判断。由于 Tikas 属于 0氪 玩家，玩过一个月的普通攻击满伤害 100E 的开拓者（古迹猎人，古弓），对轻氪和中氪并不是很了解，以下职业推荐纯属个人推荐，仅供大家参考。知道了怎么选主号的三大要素，然而，还是不会选择那个职业来做主号，这是因为对这些职业不了解导致的，首先要先知道这些职业的特性，以及技能情况，才更好去选择。 在这里呢，我已经选择出来一些，给大家参考参考：战士： 神之子刷怪升级：★★★★★打王能力：★★★✰✰保命能力：★★★★★上手难度：★★✰✰✰灵活指数：★★★★★ 剑豪刷怪升级：★★★★★打王能力：★★★★✰保命能力：★★★★✰上手难度：★★★★✰灵活指数：★★★★★ 弓箭手： 破风使者刷怪升级：★★★★✰打王能力：★★★★★保命能力：★★★★✰上手难度：★★★★★灵活指数：★★★★✰ 开拓者刷怪升级：★★★★★打王能力：★★★★✰保命能力：★★★★✰上手难度：★★★★★灵活指数：★★★★★ 盗贼： 暗夜行者刷怪升级：★★★✰✰打王能力：★★★★★保命能力：★★★★✰上手难度：★★★★✰灵活指数：★★★★✰ 夜使者刷怪升级：★★★★★打王能力：★★★★★保命能力：★★★✰✰上手难度：★★★★★灵活指数：★★★✰✰ 影武者刷怪升级：★★★★✰打王能力：★★★★★保命能力：★★★★✰上手难度：★★★✰✰灵活指数：★★★★✰ 海盗： 重炮指挥官刷怪升级：★★★★✰打王能力：★★★★★保命能力：★★★✰✰上手难度：★★★★✰灵活指数：★★★★✰ 法师： 主教刷怪升级：★★★★✰打王能力：★★★✰✰保命能力：★★★★★上手难度：★★★★★灵活指数：★✰✰✰✰ 以上就是 Tikas 暂时推荐的一些职业，后继有空撰写一篇文章专门讲解各职业特点，还有很多职业都值得去玩的，推荐只供参考，并不是唯一选择。 其中法师推荐主教是因为后勤非常好！凯内西斯和炎术士这两个都有二段跳，非常适合喜欢二段跳的玩家如果你心中有更好的职业做主号，这些参考，可以无视。如果你心中不知道选择那个职业做主号，不妨从上面推荐的职业选择一个，各项能力好能有 四星 以上的会比较好些。三、氪金延伸在氪金里面，我佩服的是 “致命香菜” ，他的主号职业是：破风使者，在装备上投入（不算轮回碑石和燃烧之戒）不到两千元，面板已经一千多万，红板更是达到 1500W 左右。氪金，是一门学术。有些人，直接购买一把：顶潜顶附加的 22星武器，这都得花费 1万 元了，如果仅仅只是这一件装备，对你的整体输出并没有多大提升，能达 400W 面板就已经很不错了！由于台服的 SS主潜 的装备并不贵，不到 50元 就可以让一件装备上 SS主潜（不能上卷保的装备除外），而 15星力也才 20元 左右，10星卷更是不值钱，顶多 1元 人民币 吧！所以，怎么去更好安排自己的氪金，这是一门学问，你不仅仅是在玩游戏，更是在深造经济学！四、Link 表经过上面之后，或许推荐的职业并没有你心中指定的职业，不管如何，建议去了解这些职业，当你去深入了解这些职业之后，选择自己所拟定的主号，再去搭配 link ，这样才能让主号更容易变强。下图是冒险岛 Link 图，大家可以看看自己优先需要那些，好去安排 Link 号排练计划。","categories":[{"name":"职业","slug":"职业","permalink":"https://xtikas.com/categories/%E8%81%8C%E4%B8%9A/"}],"tags":[{"name":"职业","slug":"职业","permalink":"https://xtikas.com/tags/%E8%81%8C%E4%B8%9A/"},{"name":"link","slug":"link","permalink":"https://xtikas.com/tags/link/"}]},{"title":"解决聊天打字全是问号-台服冒险岛新枫之谷玩家交流就是这么轻松","slug":"解决打字方块问题","date":"2020-03-07T12:41:39.000Z","updated":"2020-10-11T05:33:08.021Z","comments":true,"path":"typing-problem.html","link":"","permalink":"https://xtikas.com/typing-problem.html","excerpt":"很多萌新可能会好奇，在新枫之谷游戏里打字会是 “？” 号显示，这是由于台服冒险岛对简体文字支持不友好导致的，请大家切换繁体输入再来交流哦！","text":"很多萌新可能会好奇，在新枫之谷游戏里打字会是 “？” 号显示，这是由于台服冒险岛对简体文字支持不友好导致的，请大家切换繁体输入再来交流哦！ 一、拼音切换简繁体现在主流输入法，拼音是用户量多，这里只以 “搜G” 输入法来为例，只需要在游戏里按以下快捷键就可以简繁体切换啦： Ctrl + Shift + F 这个快捷键可以在输入法设置里修改的哦，其他输入法请自行找找哈，如下图所示： 二、五笔输入法设置由于大多五笔对 win10 系统支持不太好友，推荐使用 “精灵五笔” 和 “花儿五笔” ，由于他们都是相同的源码（反正怎么看都是一样的，先打上一个相同源码吧），其设置方法应该是一样的，本文以 “花儿五笔” 为例。 打开花儿五笔设置程序，在常用这里，把初始状态的输入开关选择 “关闭（英文）”，这样可以把其他输入法都去掉，默认就只有一个五笔，同时，默认是不打字的英文字母输入，我非常喜欢这样。 在需要打字时，只需要按一下 左边的 Shift 键就可以了。请注意，由于本文一会要把右边的 Shift 设置为繁体切换，所以，请大家养成以 “左边 Shift 键” 为中英文切换，常用里设置如下图： 接下来，就是设置 右边 Shift 键为简繁体切换啦。同样在花儿五笔设置，在高级选项，点击 “按键功能” 打开快捷键配置程序，（这里要注意，请不要勾选前面的 “禁用按键组合功能定义” ，不然设置会失效！），如下图： 在按键配置程序里的右边 Shift 键，弹出的菜单里选择：扩展功能-&gt;简体码表转繁体 ，完成设置保存之后，到此，就设置完成啦！ 默认程序为打英文，要打中文时，按一下左边的 Shift，就是中文了，如果需要打繁体，再按一下右边的 Shift 键，就是繁体输出啦，不想繁体时，再按一下 右边的Shift ，就是简体啦，非常方便，只需要按一个键就可以搞定！ 三、补充相关如果你在游戏里想打：爲什麼？，会发现繁体的 “爲” 字显示是问号，你需要为这个繁体的 “爲” 字设置一下自定义短语，这样会好些，正确能显示的为什么是这样的： 简体：为什么？繁体：爲什麼？（游戏里显示：？什麼）正确繁体：為什麼？（游戏里显示：為什麼） “為” 的五笔打法：etno 或者 ytno 还有一些常见词，比如做着什么事的 “着” 也是显示不出来的，其实是要打成：“著” 就可以了，更多的自己网上找找吧，这里就不再补充啦~ 四、相关链接搜G拼音输入法：（链接不见了） 精灵五笔输入法：精灵五笔花儿五笔输入法：花儿五笔","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"}]},{"title":"台服冒险岛新枫之谷解锁教程-必看篇","slug":"解锁教程","date":"2020-03-07T11:45:24.000Z","updated":"2021-01-22T15:52:16.523Z","comments":true,"path":"unlock-tutorial.html","link":"","permalink":"https://xtikas.com/unlock-tutorial.html","excerpt":"","text":"当您看到 “账号是否为正常状态” 时，请不要紧张，这多是您的号触发了反外挂机制。 我们只需要和客服联系一下，发个电邮联络一下，就可以等待客服跟进处理完，就可以解除 “确认你的 Gash 账号与游戏账号是否为正常状态” 了。 一、为什么会被锁号？新枫之谷的账号锁号了，账号会显示 “灰色” 的状态，尝试进入游戏，会提示 “确认你的 Gash 账号与游戏账号是否为正常状态”。 多为下面几个原因导致： 1.通常账号被锁，是保护账号安全的一种措施，这多是切换 IP 频繁，异常操作过多，系统会自动帮您的账号锁定，以保护您的账号安全。当然，这情况多是在刚刚注册新账号不久的用户（注册不到半年的账号）。 2.账号没有进行进阶认证也会提示这个，请进阶认证之后尝试，就可以正常进入游戏。 3.触发反外挂机制，系统需要核实您的账号信息，这情况下，也会锁定。只需要提交解锁申请就可以得到解锁了。 4.游戏内角色名采用全英文名，或者英文加数字组合，没有任何一个中文文字，这情况也会频繁被锁！因为许多工作室都采用这种命名方式，反外挂系统很容易误判您的账号为工作室账号。 5.购买的道具异常（黑货），当号主找回时，你的账号会被锁定，直到调查完异常道具前后来源之后，才能得以解锁。如果您在这期间，不能提交相关证明，您购买的道具将会清除！ 6.使用黑卡储值卡进行充值时，也会被锁定账号，直到补全黑卡的点数，才能解锁。 7.待续……可能还有其他没补全的，暂时就上面这些吧。 二、查询锁号的原因查看被锁原因，可以点 “会员中心” - “查询记录” - “大事件” 里查看。 选择当前月份，再选择 “枫之谷” 游戏，点击 “查询” 就可以显示出锁号的原因。 之前的大事件是不能查询当天的，最早是昨天的，现在不知道能不能查询当天的信息了。 三、台号解锁方法台号只需要拨打 +886 2-21926100 （如移动可以使用 12593 ，在 886 前面加多两个 0，如：12593 00886 221926100，不用空格，这里的空格只是为了方便阅读。） 实际披打号码示例：1259300886221926100 不是账号进阶的电话号码也能解。 打通电话之后说明自己的被锁账号，客服会验证您绑定的电话号码，以及绑定的邮箱。 信息核对无误就可以解锁啦。 当然，如果道具异常之类的，就需要您提供道具来源信息了。 四、港号解锁方法流程如果您从未进过游戏，您应该是未进行进阶认证！请查阅此文，里面有详细的进阶步骤：新枫之谷入坑指南-必看篇：四、进阶认证 beanfun 平台账号 港号并没有台号那样解锁方便，因为港号需要发解锁申请表以及在线填写相关信息给客服，客服才能跟进和处理。 从效率上来说，并没有台号那么快。一般是半小时到两天左右。 受疫情影响，2020年上半年香港客服消失，解锁进度缓慢，请误封和被锁的同学，继续申请解锁解封！不知道是否由于是这次疫情原因，从 3月 底开始，到 5月，香港客服处理进度非常缓慢！请大家别放弃解锁！（我的号竟然长达一个月没解锁！F***）如果您的账号是被锁状态超时很久，账号内会被清空（官方回复说不会清空，但是事实就是里面角色都没了） 下面就开始台服冒险岛新枫之谷港号的正式解锁步骤： 第 1/2 步，解锁前准备 前往 beanfun 客服中心的 “下载表格” 页面下载 “beanfun 账号身分证明声明书”：香港 beanfun 客服中心http://hk.games.beanfun.com/faq/service.asp或者偷懒，直接下载 word 表格文件：下载账号身分声明书文件http://hk.games.beanfun.com/faq/doc/form2.doc声明文档是有两页的，第二页完全空白，只需要打印只第一页内容就行。用铅笔如实填写自己的信息（方便日后修改日期再次使用），地址尽量同证件信息里一字不少，就行。填写完，放上自己的证件，用手机拍摄，或者扫描，这张图片就是申请解锁时的附件啦，如下图所示： 打开查看：解锁申请文档表格填写扫描拍摄演示图 第 2/2 步，在线申请解锁 打开香港游戏橘子客服中心页面：香港 beanfun 客服中心http://hk.games.beanfun.com/faq/service.asp或者点 “第三方缤放” 界面里的 “客服中心”，点左侧的 “联络客服”：选择 “电邮联络”选择 “beanfun!会员”，（如果是网页进来，你可能需要登录）接下来就要填写相关信息了，这里填写大概如下： 填写参考建议问题分类请选择：Maple Story 新枫之谷，这样会更快速进行问题处理问题详细分类请选择：游戏服务-自我锁定/解除，这里试过其他选项，也是能解锁账号锁定的。角色名称，请填写游戏账号内角色的名字，比如你在游戏内有一个米憨憨叫：“这是米憨憨”，那么这里就写：这是米憨憨。伺服器很关键，别选错了，由于是合区之前的服务器，Tikas 已经把这些合区信息收集如下：【艾麗亞】：雪吉拉【普力特】：菇菇寶貝、木妖、海怒斯【琉德】：星光精靈【優依娜】：緞帶肥肥、綠水靈【愛麗西亞】：藍寶、電擊象、九尾妖狐、皮卡啾、神獸、葛雷金剛、喵怪仙人、西格諾斯、寒霜冰龍、泰勒熊【殺人鯨】：三眼章魚、火獨眼獸、鯨魚號、蝴蝶精、巴洛古、時間女神使用的宽频公司随意选择，我一般选择其他问题发生的时间，就写当前的，之前有写过昨天发生的时间，被拒绝了，不知道有没有其他人同我一样。建议写当前的日期和时间。内容描述写客观真实的就行了，请注意言语用词，要尽量友善，这要体现出自己的人格魅力。然后拍摄或者扫描的手写声明书一定不能忘记上传了！很多小伙伴们都在问怎么上传身份证呢！T_T别忘记点 “上載” 按钮了！接下来等待就可以了，一般半小时到三天之间（周未好像没有工作人员审核）正常工作日，解锁平均时间都是在 3小时内，要不了多久的。自己也可以通过 “客服中心” 的 “联络客服” 里的 “查询电邮” 进行查看处理进度及结果。填写表格并不是说一定要用繁体，简体中文也一样解锁的，本着方便他人，就是方便自己，建议大家在 “内容描述” 里用繁体进行填写，这样跟进邮件时就看不到 “？” 号啦！如果您是其他原因被锁，请填写相关内容信息，或者提供相关证据如果您的账号是深夜注册的，可能会提示服务账号不存在，这时也需要进行解锁操作，过程都是一样。问题分类为 beanfun账号问题：登入游戏问题，内容描述填写就以您进行启动游戏时，提示服务账号不存在就可以了。（由于是新号，角色名称还没有，可以填写：没创建等明显是新号的字面意思）建议等待一两天，这多是由于维护期间注册的账号导致数据同步不过来，等一天左右基本上就能正常使用账号进行游戏了。如果您是因为道具异常原因被锁，那么您还需要提供道具来源途径了。如：交易时间、交易地点、交易对象，最好能有整个交易过程的相关截图。如果是由于使用黑卡导致，请补全负数点数之后，填写已补全就可以了。:( 五、港号解锁步骤同样适用于其他需要联系客服的情况港号的解锁方法，这个步骤还适用其他需要客服解决的情况，如： 如果您需要修改二级密码，可以发此申请表给客服，填写内容为：需求更改游戏二级密码，您不在游戏的时间段，以及您在游戏的时间段。 比如：客服大大，我需要修改二级密码，早上 10点到 12点不在线，中午 12点后就会在线，有劳了。 当然别忘记说要改成的二级密码是什么，不然，客服都不知道：到底是要那个密码做为二级密码。XD 如果您忘记了自己的密码，连保安问题的答案也忘记了，您就不能使用这个方法来修改账号的密码了。这时，您可以给香港 beanfun 客服致电寻求解决办法，电话：(852) 37115511例如移动手机可以披打：125930085237115511一般是需要您下载 “香港游戏橘子客服传真表” 填写好并传真过去，当然您可以同客服沟通好以扫描图片方式发邮件过去。香港橘子客服传真热线：(852)2169-8799 六、误封永久的账号解封方法如果您的账号被误封永久了，一样可以使用本教程的解锁步骤去解封，内容填写实际情况就行。 只要是误封的，都会得到解封。 著名的大面积误封永久事件2020年3月份月底斗燃练猫号到 200级会被封永久的同学，我已经收到解封了，如果你的号还没解封，请继续发邮件申请解封！斗燃练幻兽师到 200级会被封永久，只需要如实说明，就行，这次误封面积很广，太多人被封永久了！ 相关链接香港 beanfun 客服中心：客服中心解锁申请表：下载地址忘记密码时使用的传真表：香港游戏橘子客服传真表","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"},{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"}]},{"title":"新枫之谷入坑指南-必看篇","slug":"新枫之谷萌新入坑教程","date":"2019-12-12T06:16:01.000Z","updated":"2021-03-21T16:33:15.445Z","comments":true,"path":"i-want-to-play-maplestory.html","link":"","permalink":"https://xtikas.com/i-want-to-play-maplestory.html","excerpt":"","text":"台服冒险岛新枫之谷，是一个充满着神奇的地方，这里不仅有着许多国服冒险岛玩家，还有着更多的台胞们，他们一起冒险过，一起同黑魔法师他们挑战过！ 这是一个困难重重的地方，入这个坑，不仅要解决游戏上号问题，还要解决被锁号问题。 以及防止被人盗号问题！ 这一切，你准备好了吗？ 《新枫之谷入坑指南》Tikas 序本文概括了游戏下载、账号注册、游戏启动，请细心一步一步看，其实很简单的。 千万别购买他人的账号或者淘宝买号，不然，锁号了就没人帮你解锁了！或者别人直接申请锁号，你的钱就没了。 考虑文章篇幅较长，大家看完之后记得再去看本站的：「解锁教程」、「充值教程」、「防盗教程」 广告：玩个游戏，还能学到这么多知识，快点收藏和分享本站吧！ 英雄们向黑魔法师发起挑战吧！Your browser does not support the video tag. 一、游戏下载如果您同我们一样都是使用加速器来玩新枫之谷的话，那么下面这点一定要记住： 使用加速器体验游戏的小伙伴请手动更新当游戏出现更新包时（或者缤放提示了自动更新可能破坏程序，已被阻止），请您一定自己去手动下载更新包进行更新：点我前往： 官网更新包发布页面如果官网更新包发布页面没有最新版本的手动更新包，可以从官网的最新消息里找到。因为使用加速器在线更新容易丢包，导致更新失败，从而破坏游戏文件！如果已经在线更新中，可以结束更新进程停止在线更新，使用手动更新包本地更新一下就可以。这方法同样适用游戏文件被破坏时进行补救！ 1.1、前往官网下载游戏 第 1/4 步，前往官网下载游戏档案（需要加速器） 打开官网下载页面https://tw.beanfun.com/MapleStory/download把官网下载页面的所有下载点都点击下载，建议使用下载工具下载。如果不想打开加速器访问官网，您可以直接复制下面所有地址到下载工具下载：V232版本下载地址（总1个文件，1个zip），更新于2021年2月25号，您能看到 Copy 吗？1https://maplestory-download.beanfun.com/maplestory/download/W2xXSbcn3Kw2/MapleStoryV232/MapleStoryV232.zip 1.2、安装游戏 第 2/4 步，安装游戏 由于台服使用了繁体编码，在简体系统中运行会显示乱码，但是，并不影响整个游戏的安装。安装的目录一定不能带有中文路径如果游戏的目录路径带有中文，您将无法正常启动游戏！ 正确的安装目录例子：C:\\MapleStory\\MapleStory.exe 错误的安装目录例子：C:\\新枫之谷\\MapleStory.exe 打开查看：安装过程出现异常错误提示（乱码显示） 如果您安装过程中一直会提示相关对话框，不能顺利进行安装，您下载回来的游戏文档可能并没有下全。请检查一下分割包 bin 的文件大小是否都一致：一般前面的几个 bin 文件，大小都是一样的，只有最后一个 bin 文件才会小些。那个文件没下载全，就补一下这个文件的下载。补全之后就能再次安装啦。 1.3、检查是否有小更新包 第 3/4 步，查看是否有当前版本的小更新包 由于您刚来台服，并不知晓当前下载的完整游戏文档，是否是最新的。如果有，建议手动下载回来更新哦！官网更新包下载页面https://tw.beanfun.com/MapleStory/download?download_type=2您也可以直接复制下面所有地址到下载工具下载：V232当前没有版本的小更新包。您能看到 Copy 吗？==》1V232已经是最新版本啦，不用检查是否有小更新包。 1.4、安装小更新包（如果有） 第 4/4 步，安装小版本更新包（如果有） 打开查看：如何手动更新新枫之谷游戏版本 第1/4步，运行更新包从上图可以看出，手动更新包运行时，获取的目录路径是当前的。大家可以把手动更新包拷贝到游戏目录内运行的哦！为了减少游戏目录所占用空间过大，推荐把更新包存放在其他地方。第2/4步，指定游戏目录点击 “…” 按钮，会弹出浏览文件夹对话框，指定到新枫之谷游戏的目录路径如下图所示（这是小T同学自己的游戏目录安装地方，并不是您的电脑游戏所在目录）MapleStory 目录下有：BlackCipher，blob_storage，GPUCache，locales，swiftshader 等目录那么这个 MapleStory 就是游戏目录路径啦！本来不想多说这一步的，实在是太多小伙伴游戏目录类似这样的：…/MapleStory/MapleStory/MapleStory.exe,然后他们分不出到底那个 MapleStory 才是正确的游戏目录第3/4步，Extract 解压覆盖吧！确保游戏目录没有错误，就开始点 Extract 按钮，解压覆盖吧！提示下图所示，就是解压到正确的游戏目录了，点：yes to all 吧！第4/4步，启动游戏启动游戏，享受游戏吧！ 1.5、旧版本升级到新版本 旧版本 - 新版本 的大版本更新包 这是给那些正在体验游戏的玩家更好的游戏体验所增加的。如果您当前正在体验游戏，明天就出新版本更新了，这时不妨来这里复制最新的大版本更新包地址进行下载。如果您是新玩家，请不用下载大版本更新包！V231-V232 大版本的更新包，更新于2021年2月25号。您能看到 Copy 吗？==》1https:&#x2F;&#x2F;maplestory-download.beanfun.com&#x2F;maplestory&#x2F;download&#x2F;W2xXSbcn3Kw2&#x2F;MaplePatch231to232.exe 二、安装官方缤放程序（必需）这里安装的官方缤放程序，并非是第三方的缤放登录器。 不安装它，您是无法正确获取密码进入游戏的哦！ 第 1/3 步，下载 beanfun！元件程序 香港 beanfun！官方元件程序下载页面http://hk.beanfun.com/locales/HK/contents/beanfun_block/help/plugin_install.html 第 2/3 步，安装 beanfun！元件程序 等待 beanfun！平台的安装完成，直到出现 “正在更新档案”，并且 更新完成 。重要提示请记笔记！如果未进行更新档案，或者更新出错，请手动运行一次桌面的 beanfun！快捷方式，或者重新安装一次官方的 beanfun程序，进行再一次安装。一定要在 “正在更新档案” 里出现 更新完成！如果还是无法更新完成，请换别的加速器，或者关掉加速器，直到出现更新完成界面。 第 3/3 步，删除桌面 beanfun！快捷方式 这一步建议还是操作一下，如果您是使用第三方缤放登录器的话，不进行这一步操作，会很容易把官方的和第三方弄混淆。找到桌面上的一个图标：beanfun！ 把这个带 “！” 的快捷键图标删除了！ 接下来 就到了注册账号这激动人心的时刻了！ 喝杯水，先绶绶。 因为这一步劝退了不少的人。不用担心！ 这一步一样很简单的！ 注册账号可以分为两部分： 1.注册 beanfun 平台账号 2.进阶认证 beanfun 平台账号 呼，准备好了吗？ Let’s go! 三、注册 beanfun 平台账号由于港服和台服已经合并。现在的新枫之谷，是同时支持港号和台号在线游戏的。由于台号已经关闭相关验证，我们主要以注册港号去玩新枫之谷。 所以，我们先弄清什么是台号，什么是港号。 台号：也就是台服冒险岛新枫之谷官网里注册的账号，他需要验证台湾号码等相关信息，注册难度大。 港号：香港专区已经没有新枫之谷的官网了，现在港号其实就是香港 beanfun 平台的账号，他一样能玩新枫之谷。 重要提示！A）如果您是在深夜注册的，可能会出现账号一切正常，获取密码的时候，一直提示账号服务不存在！请别在深夜注册账号！B）如果您是在维护期间注册账号，也可能会出现提示账号服务不存在！请别在星期三的 00：00-15：00 时段进行账号注册！C）由于大量工作室涌入，在2020年5月底注册的新号，将暂时无法取得密码！现在已经恢复，后续难免还会出现此情况。如果您真的提示了：“服务账号不存在”。请查阅解锁教程进行联系客服，问题请选择 beanfun 账号相关，并如实描述。 这里提供两种注册方法，其实都是通过同一个网页注册的账号，只是使用第三方缤放在注册上体验感会好很多。 为了自己的账号安全，不建议使用 QQ 号码的邮箱做账号！例如：&#x31;&#50;&#51;&#x34;&#53;&#64;&#81;&#81;&#46;&#x63;&#x6f;&#x6d; —— 重要提示请记笔记！ 3.1、使用网页进行账号注册由于港号使用了较旧的技术，只支持 IE 浏览器。这一步的所有操作都将在 IE 浏览器里进行，请确保您所使用的是 IE 浏览器！ 打开查看：使用网页进行账号注册 第 1/3 步，去掉 IE 浏览器的保护模式打开 IE 的 Internet 选项，在安全里去掉 “启用保护模式”，保存并关掉 IE ，重新打开 IE 就生效了。如下图所示：第 2/3 步，打开账号注册页面香港橘子 beanfun 账号注册页面http://hk.beanfun.com/locales/HK/contents/beanfun_block/help/plugin_install.html第 3/3 步，填写相关信息点加入会员，进行账号注册，整个信息建议要真实，可以用 QQ 邮箱注册。(如果你的邮箱无法收到邮件，请尝试更换别的邮箱注册)如果提示网页未显示完整内容，请选择显示所有内容。以下请记好笔记上图有三点是非常重要的，特别是“保安问题”，在修改密码时，是非常重要的验证！A 为港号的账号，这是橘子平台的账号，不是游戏账号，我们是先登录游戏平台再启动游戏的。B 为昵称，算是游戏账号的别名，随意，简单些，可中文，注册完成后添加账号时，请填写这个昵称！（之前出现过未填写此昵称无法正常进入游戏 BUG，建议请填写这个昵称）C 为重中之重，这答案关系到你能不能快速方便在忘记密码时修改密码出生日期不能乱选择，必需要和自己证件号码相对应，不然注册的账号无法进入游戏为了后续方便解锁申请，请真实填写相关个人信息以上 A 和 C 非常重要！以上 B 为昵称，并非账号！注册完会提示你前往自己的邮箱验证，验证完之后，就算是初步成功啦！ 3.2、下载第三方缤放登录器，并进行账号注册第三方缤放登录器是一个非常好用的工具。然而，由于并非官方发布的，也有不法人士进行对他修改捆绑了盗号程序，让开发者非常难过。 如果您同我一样，非常喜欢使用登录器玩游戏（体验感非常好），建议您一定要去作者官方的 Github 下载！ 由于第三方缤放软件并不像猪头那样取一个别名，第三方缤放不仅图标同官方一样，连名字也是，这会让超多的人会误认为这是官方的不说，还会让一堆的萌新分不出那个是真，那个是假（虽然都是真的）在这里特别声明一下： 官方的缤放是一个平台的服务程序，名字是：beanfun! 第三方缤放是一个登录程序，名字是：beanfun 他们唯一区别是：是否带一个 “！” 很多人说本文没有第三方缤放登录器下载地址，请点开下面：使用第三方缤放登录器进行账号注册，查看！ —— 重要提示请记笔记！ 打开查看：使用第三方缤放登录器进行账号注册 第 1/4 步，前往作者 Github 页面下载第三方缤放 Github 下载页面https://github.com/pungin/Beanfun/releases第 2/4 步，下载缤放登录器在这个页面的内容最上方，一般就是最新版本，直接点击 “點擊下載「繽放」” 就可以下载了。如果无法下载，可以尝试点击 Assets 里的：Source code（zip）第 3/4 步，查杀是否安全由于涉及到资金安全，建议大家下载回来的缤放登录器，先进行安全检测。在线查杀：中文 virscan | 国际英文 virustotalWindows 7 系统请安装最新版本 net 运行库如果您是使用 Windows 7 系统，需要安装更高版本的 net 运行库，以解决缤放登录器未响应停止运行等问题。如果安装了最新版本的运行库依旧不能正常运行，请确保您的系统是否是官方原版镜像！ 查看安装最新版本 net 运行库 第 1/3 步，运行缤放时，出现已停止工作等无法正常运行情况第 2/3 步，前往微软官方下载运行库微软 .NET Framework 下载页面https://dotnet.microsoft.com/download/dotnet-framework第 3/3 步，选取最新版本并进行下载这里以新版本 4.8 版本为例子，建议大家也是下载新版本（本文写于 2019年，后续建议下载最新版本）。如图所示：点 Download .NET Framework 4.8 Runtime 下载 第 4/4 步，运行缤放登录器进行注册账号首次启动缤放时，如果有下图提示，请选择 香港（hongkong）在 “HongKong” 登录界面点击右边 “注册账号”以下请记好笔记上图有三点是非常重要的，特别是“保安问题”，在修改密码时，是非常重要的验证！A 为港号的账号，这是橘子平台的账号，不是游戏账号，我们是先登录游戏平台再启动游戏的。B 为昵称，算是游戏账号的别名，随意，简单些，可中文，注册完成后添加账号时，请填写这个昵称！（之前出现过未填写此昵称无法正常进入游戏 BUG，建议请填写这个昵称）C 为重中之重，这答案关系到你能不能快速方便在忘记密码时修改密码出生日期不能乱选择，必需要和自己证件号码相对应，不然注册的账号无法进入游戏为了后续方便解锁申请，请真实填写相关个人信息以上 A 和 C 非常重要！以上 B 为昵称，并非账号！注册完会提示你前往自己的邮箱验证，验证完之后，就算是初步成功啦！赞助卖力萌开发者，让缤放得到支持！ 打开查看：捐赠开发者，让缤放更好用 第三方缤放登录器是个人开发，如果你有实力，请赞助他，以鼓励作者更有动力去改进他。点击缤放右上角的问号，在关于页面的右下角，可以找到捐赠入口。 请不要选中自动登录由于新版本选中自动登录，会出现各种卡死、闪退现象，请大家一定不要选中 “自动登录”，只需要记住密码就可以了。 四、进阶认证 beanfun 平台账号之前只是注册了 BF（Beanfun） 账号，并不是游戏账号，未进行进阶认证的 BF 账号，是无法进入游戏的，SO ,赶紧去认证吧！ 一、使用 IE 浏览器进行进阶认证二、使用第三方缤放登录器进行进阶认证打开橘子 beanfun 首页http://hk.beanfun.com/Default.aspx 在首页的右下角，登入刚刚注册的账号。 然后，在同样的右下角里，点击会员中心。 点击 會員中心 打开个人信息以方便进行进阶认证。 请如实填写自己的相关信息，上图箭头所指，两个都要进阶认证。 如果先 “身份證進階認證”，再进阶认证电话进阶认证时，可以点左边的会员资料，展开的菜单里再点会员资料，就可以回到之前进阶认证页面。 电话进阶验证，请选：SMS 方式进行进阶认证。 从2020年开始一个手机号码只能进阶认证一个账号 —— 重要提示请记笔记！ 当身份号码和电话都进阶认证完之后，账号就算是正式注册完成。 接下来添加一个账号名称吧，随意取个名。登入账号后，请找到并点击 “會員中心” 请不要选中自动登录！这会很容易导致各种卡死！！！ —— 重要提示请记笔记！ 点击上图的 “会员中心”， “客服中心” 左边那个。 请如实填写自己的相关信息，上图箭头所指，两个都要进阶认证。 如果先 “身份證進階認證”，再进阶认证电话进阶认证时，可以点左边的会员资料，展开的菜单里再点会员资料，就可以回到之前进阶认证页面。 电话进阶验证，请选：SMS 方式进行进阶认证。 从2020年开始一个手机号码只能进阶认证一个账号 —— 重要提示请记笔记！ 当身份号码和电话都进阶认证完之后，账号就算是正式注册完成。 接下来添加一个账号名称吧，随意取个名。 刚刚完成进阶认证的账号，需要等待 5分钟 左右，才能正常进入游戏。有时大版本更新时，在维护期间，数据更新会慢一些，您可能要等待一天了（很少出现）。 五、启动游戏的 3 种方法beanfun 账号都认证了，是不是很想尝试进入游戏呢？ 这时直接运行游戏会提示：This client can be executed only in Traditonal Chinese code-page 别急，你还需要知晓三种启动游戏的方法之一，才能正常体验游戏。 一、使用网页进入游戏二、使用第三方缤放登录器进入游戏三：使用 LE 启动游戏要想使用网页启动游戏，你需要把电脑的区域设置为繁体台湾。 打开：控制面板，在控制面板里找到区域。如果你的是 “类别” 显示，你应该先找：时钟和区域，再在里面找到 “区域” 在区域设置的 “管理” 非 unicode 程序的语言里，点击 “更改系统区域设置”，选择设置如下图： 设置繁体区域之后，建议不要使用缤放来启动游戏啦，不然容易报：C00700C1 错误。 这样就可以直接启动台服冒险岛新枫之谷啦。使用 “第三方缤放” 可以很好解决 “This client can be executed only in Traditonal Chinese code-page” 这类问题，因为 “缤放” 已经引用了 Locale Emulator 模块，简体系统，一样玩新枫之谷！ 第三方缤放登录器的下载可以参考本文前面的：3.2、使用第三方缤放登录器进行账号注册 在设定界面指定一下新枫之谷的游戏路径，设定按钮在 “缤放” 的右上角那一排可以找到。 设置界面如下： 其中选中 “传统登入模式”，就会有 “获取密码”，这样就能获取动态登入游戏了 如果您是新人，建议不要选中 “传统登入模式”，这样点启动游戏就会直接登录您的游戏账号 如果没有勾选获取密码旁边的 “自动输入”，那么您需要手动复制游戏账号及动态密码 千万不要在游戏登录界面里输入注册的 beanfun 账号和密码来登录游戏！台服冒险岛新枫之谷使用的是：beanfun 账号获取游戏账号的动态密码进行登录游戏的！如果不知晓怎么查看自己的游戏账号和密码，可以看下面的：“打开查看：启动游戏会提示：未选择启动游戏的账号” 打开查看：启动游戏会提示：未选择启动游戏的账号 如果你的账号是刚刚注册的，登录缤放之后，是无法获取密码的，你还需要进行下列操作：1.在缤放主界面右下角，点击 “新增账号”2.在 “使用者名称” 里输入注册账号时填写的昵称（其实可以随便填的，但是发生过 BUG，这个 BUG 应该不会再出现了。）3.如果你的缤放底下没有获取密码按钮，那么你需要在 “设定” 里选中 “传统登入模式”4.新版本缤放默认是隐藏了账号，你可以在账户名称里双击复制你的账号。（如果选中自动输入，获取密码后，缤放会自动帮你输入账号和密码） 如果使用第三方缤放登录器遇到一些困难或者错误等，可以参考这篇文章，有着许多常见的问题解答： 新枫之谷第三方缤放登录器使用教程-完全篇/beanfun-stop-working.html使用 LE 来启动游戏，可以比较好解决缤放新版本卡死的问题。 启动游戏之后，使用第三方缤放登录器获取密码来进入游戏。 非常不错的一个方法： 「使用 LE 启动游戏更快捷」- 这样可以跳过缤放来启动游戏哦/launch-with-locale-emulator.html 六、重要：没看这一步的人都哭晕了！第一次提示的密码为二级密码，非常重要！ 创建角色、进入仓库、现金道具交易等都需要他，尽量简单易记就行，别太复杂！ 创建游戏角色名请一定要包含中文！不然容易锁号！ 注：有时 “创建角色” 按钮灰色时，你需要等一等，之后就会激活 “创建角色” 按钮！ 全英文的游戏名容易锁号！ —— 重要提示请记笔记！ 每周三会进入维护，一般是早 8点 到中午 14点大维护时期看官网公告。维护期间是无法进入游戏的！ 如果账号是刚刚注册，别急着进游戏，先放松几分钟，不然，会提示下面错误： 等几分钟后（这个过程可能是需要同步港号的相关数据，有时需要隔一两天），就可以进游戏啦！ 如果你等一段时间还是提示这个，请确认你的账号是否进行了两次进阶认证！ 好像从 2020年 3月份 开始，就提示为 “请确认您的 Gash 账号与游戏账号是否为正常状态” 相关链接beanfun：橘子官网官方缤放元件程序下载：香港 beanfun 元件程序下载第三方缤放登录器下载地址：作者官方 Github 下载页面在线查杀：中文 virscan | 国际英文 virustotal第三方缤放教程：新枫之谷第三方缤放登录器使用教程-完全篇游戏下载地址：点我查阅本文的第一部分如果有更新包，请别忘记下载更新包哦！","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"},{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"}]},{"title":"新枫之谷第三方缤放登录器使用教程-完全篇","slug":"缤放全攻略","date":"2019-12-12T06:16:01.000Z","updated":"2021-01-26T01:18:08.183Z","comments":true,"path":"beanfun-stop-working.html","link":"","permalink":"https://xtikas.com/beanfun-stop-working.html","excerpt":"","text":"缤放登录器并非官方开发的，他是第三方卖力萌开发者所开发的，然而早已经是众多玩家爱不释手的工具了。由于非常的便利，这也让很多不法盗号者盯上了这个工具。导致很多用户经常问缤放登录器安全吗？ 放心！ 本文从：如何下载、如何使用、以及一些常见问题解决等，全方位解答这款软件，不用担心在一些不安全的地方下载，也不用担心各种出错报错的问题没法解决。 您准备好了吗？ 一、缤放登录器下载 第 1/3 步，前往作者 Github 页面下载 第三方缤放 Github 下载页面https://github.com/pungin/Beanfun/releases 第 2/3 步，下载缤放登录器 在这个页面的内容最上方，一般就是最新版本，直接点击 “點擊下載「繽放」” 就可以下载了。如果无法下载，可以尝试点击 Assets 里的：Source code（zip） 第 3/3 步，查杀是否安全 由于涉及到资金安全，建议大家下载回来的缤放登录器，先进行安全检测。在线查杀：中文 virscan | 国际英文 virustotal Windows 7 安装最新版本 net 运行库以解决闪退、打不开、未响应等问题 如果您是使用 Windows 7 系统，需要安装更高版本的 net 运行库，以解决缤放登录器未响应停止运行等问题。不然很容易就缤放已停止工作了，缤放登录器打不开的原因就是这个运行库的问题。如果安装了最新版本的运行库依旧不能正常运行，请确保您的系统是否是官方原版镜像！ 查看安装最新版本 net 运行库以解决缤放已停止工作 第 1/3 步，运行缤放时，出现已停止工作等无法正常运行情况第 2/3 步，前往微软官方下载运行库微软 .NET Framework 下载页面https://dotnet.microsoft.com/download/dotnet-framework第 3/3 步，选取最新版本并进行下载这里以新版本 4.8 版本为例子，建议大家也是下载新版本（本文写于 2019年，后续建议下载最新版本）。如图所示：点 Download .NET Framework 4.8 Runtime 下载 Windows 10 无法正常运行打开缤放 很多人使用盗版系统，往往会精简了很多东西。亲，如果您是 win 10 系统，却无法运行第三方缤放登录器，请重新安装一个微软官方的系统。 赞助卖力萌开发者，让缤放得到支持！ 打开查看：捐赠开发者，让缤放更好用 第三方缤放登录器是个人开发，如果你有实力，请赞助他，以鼓励作者更有动力去改进他。点击缤放右上角的问号，在关于页面的右下角，可以找到捐赠入口。 请不要选中自动登录由于新版本选中自动登录，会出现各种卡死、闪退现象，请大家一定不要选中 “自动登录”，只需要记住密码就可以了。 二、内置实用的小工具登录缤放之后，在主界面的右边，可以找到一个 “工具” 按钮，里面有一些很实用的小工具哦！ 最实用的装备卷轴星力计算器 使用方法是：选择对应的装备部位，对应的等级，在 A 和 B 里填写装备自身的属性，就可以啦。其中：A、装备当前星力强化等级（就是多少星的装备啦）B、是装备原本白色的属性值，这个一定要填写哦，不然像武器类他的攻击加成是按装备自身多少攻击来算的。C、这是星火属性值，写上去，如果最终上卷正确，就能在左边的总值和装备对得上，不填写这个就会少星火属性。也许最终加上卷的值，装备的属性会比计算器的多一些攻击，这是因为天然白板装时，就有浮动的属性加成。 三、需要安装 beanfun登录器 香港服务程序，才能正常使用第三方缤放登录器登入游戏！如果您没有安装橘子官方的服务程序，那么您将会无法正常使用 “第三方缤放登录器” 香港 beanfun！平台程序下载页面http://hk.beanfun.com/locales/HK/contents/beanfun_block/help/plugin_install.html 四、缤放登录器的基本使用从这开始是介绍缤放登录器的一些基本操作使用，如果您对这些了如指掌，大可节约时间，跳过这一部分。 大神们 珍惜时间哦！ 4.1、指定游戏目录，才能用缤放启动游戏亲，您只需要在设定界面指定一下新枫之谷的游戏路径就可以了，设定按钮在 “缤放” 的右上角那一排可以找到。 设置界面如下： 其中选中 “传统登入模式”，就会有 “获取密码”，这样就能获取动态登入游戏了 如果没有勾选获取密码旁边的 “自动输入”，那么您需要手动复制游戏账号及动态密码 如何复制可以看下面一小节： 4.2、没有添加账号，启动游戏会提示：未选择启动游戏的账号 如果你的账号是刚刚注册的，登录缤放之后，是无法获取密码的，你还需要进行下列操作： 打开查看：在缤放里增加账号 1.在缤放主界面右下角，点击 “新增账号”2.在 “使用者名称” 里输入注册账号时填写的昵称（其实可以随便填的，但是发生过 BUG，这个 BUG 应该不会再出现了。）3.如果你的缤放底下没有获取密码按钮，那么你需要在 “设定” 里选中 “传统登入模式”4.新版本缤放默认是隐藏了账号，你可以在账户名称里双击复制你的账号。（如果选中自动输入，获取密码后，缤放会自动帮你输入账号和密码） 4.3、缤放启动游戏后，右下角只提示 NGS，就没了这情况的过程如下描述： 启动游戏之后，跳过了 play 界面，并且右下角的 NGS 安全图标也提示了，之后，并没有出现游戏界面 这往往可能你的游戏安装路径带有中文导致的，请把游戏的父级目录里中文改成非中文，或把台服冒险岛新枫之谷，拷贝到别的地方。 就可以解决这个问题啦！ 如果 NGS 一直提示，不会消失，那么请重新下载安装一次游戏NGS 一直提示，不会消失，多是游戏文档出现破坏，导致的。出现这种情况，就需要卸载游戏，重新安装一次了。如果重新安装之后还是这样，那么，多数情况下，您下载的游戏文档是不完整的，请重新下载一次游戏文档，以方便进行重新安装游戏。如果重新安装之后还是无法进入游戏，请联系我，谢谢！ 五、缤放登录器报错的常见问题及解决方法这里撰写了一些使用过程中常见的问题，都是比较需要注意的。 如果在这里没有找到答案，不妨把你的问题告诉我，感谢提供问题或者提供答案！ 在线联系取得帮助（请备注原因哦）：QQ:87182380 5.1、来自缤放的警告：自动更新可能破坏程序，已被阻止 这是由于缤放登录器默认是阻止自动更新的！ 也请大家别让游戏自动更新，原因：由于我们都是使用加速器玩新枫之谷，在线更新很容易发生数据丢失（就是丢包现象，平时玩的时候会卡顿），所以建议大家手动更新！ 打开查看：如何手动更新新枫之谷游戏版本，以解决游戏更新卡住、失败、很慢及资料受损问题 第1/5步，下载最新的游戏小版本更新包前往官网更新包页面下载https://tw.beanfun.com/MapleStory/download?download_type=2如果这里没能找到，您可以从官方的 版本更新公告 里可以找到下载链接。或者可以访问本站的 “入坑指南” 下载小节里找到更新包的链接。第2/5步，运行更新包从上图可以看出，手动更新包运行时，获取的目录路径是当前的。大家可以把手动更新包拷贝到游戏目录内运行的哦！为了减少游戏目录所占用空间过大，推荐把更新包存放在其他地方。第3/5步，指定游戏目录点击 “…” 按钮，会弹出浏览文件夹对话框，指定到新枫之谷游戏的目录路径如下图所示（这是小T同学自己的游戏目录安装地方，并不是您的电脑游戏所在目录）MapleStory 目录下有：BlackCipher，blob_storage，GPUCache，locales，swiftshader 等目录那么这个 MapleStory 就是游戏目录路径啦！本来不想多说这一步的，实在是太多小伙伴游戏目录类似这样的：…/MapleStory/MapleStory/MapleStory.exe,然后他们分不出到底那个 MapleStory 才是正确的游戏目录第4/5步，Extract 解压覆盖吧！确保游戏目录没有错误，就开始点 Extract 按钮，解压覆盖吧！提示下图所示，就是解压到正确的游戏目录了，点：yes to all 吧！第5/5步，启动游戏启动游戏，享受游戏吧！ 5.2、 提示:无法加载进行反序列化所需的类型 beanfun records从 3.0.1 版本开始，Pungin 作者重新更新了本地记录文档，旧版解析新版本的本地记录文档就会提示 “无法进行反序列化” 打开查看：解决无法加载进行反序列化所需的类型 由于作者在 2020年4月7号进行更新了 3.0.1 版本，如果有同学进行更新了，并且出现下面两个提示：那么，您的缤放，应该是更新完之后，没能替换原来的旧版本，或者是桌面的快捷方式里的版本未能进行替换导致：运行旧版本（3.0.0版本之前的）都将会提示 “Beanfun Records！” 错误。解决办法是前往作者的 Github 下载最新版本的缤放，就可以解决这个问题。第三方缤放 Github 下载页面https://github.com/pungin/Beanfun/releases不建议删除账号记录文件以启动旧版本为目的的操作删除缤放账号记录文件方法:按 “Win + R” 键打开运行，在运行里输入：%appdata%在 “AppData\\Roaming” 里删除 “Beanfun” 目录就可以。如非必要，请不要删除此文档，不然，您所记录的所有账号密码将清空！ 5.3、缤放启动游戏之后就卡住这是作者更新之后，修改相关代码导致的，没优化好，建议使用 LE 来启动游戏，这样缤放就不用因为启动游戏而停止 查阅：使用 LE 启动游戏，解决缤放卡死情况/launch-with-locale-emulator.html 5.4、检查到档案数位签章错误，请洽客服人员 解决办法： 打开浏览器进入 香港beanfun 外挂程式页面（憨憨的名字……），下载并安装 beanfun！程序，就可以了。 橘子 beanfun 程序下载页面http://hk.beanfun.com/locales/HK/contents/beanfun_block/help/plugin_install.html 5.5、非繁体语系系统启动游戏失败，提示：C00700C1有三种原因导致这情况出现： 1、使用了自动更新，导致游戏文件被损坏，请重新安装一次游戏或者找朋友另外复制一个游戏主程序过来试试（建议大家别用自动更新） 2、更改了语言区域导致区域异常，也会提示这个，解决办法就是简体语言和繁体语言换一换来尝试看看了 3、被安全软件拦截了 LE 模块，比如使用了 3** 相关安全软件。建议到 msdn itellyou 里下载镜像重装系统！ 5.6、缤放启动游戏提示错误码：C0000135如果你的缤放启动后提示：C0000135，这可能是缤放的 LE 模式被相关安全软件拦截，或者你的系统本身之前有修改过其他语言区域。 解决办是修改回简体语言环境，或者改为繁体语言环境 如果你想改为繁体语言环境，可以参考本文的前面：查阅:三、两种启动方式（一、使用网页进入游戏） 5.7、缤放无法登录账号（3.0 之前的旧缤放版本）如果你的缤放登录器是 2.9.9 版本之前的，那么提示无法登录账号，就是没有安装橘子官方的 beanfun 平台程序导致的 如果是 3.0 版本之后的，那么你可以看看是否网络问题导致的，有时 网络故障 就无法登录了，请换加速器看看。 打开查看：解决缤放无法登录账号问题 此类问题是由于未安装 beanfun 平台导致的，一般是初次运行 “缤放” 时，未能及时安装 BFservice元件 导致的：解决办法：打开浏览器进入 香港beanfun 外挂程式页面（憨憨的名字……），下载并安装 beanfun！程序，就可以了。橘子 beanfun 程序下载页面http://hk.beanfun.com/locales/HK/contents/beanfun_block/help/plugin_install.html 5.8、启动失败，请尝试从桌面捷径启动游戏。若您系统为非繁体语係系统，可能是 Locale Emulator 元件不支援您的系统。这是由于您的缤放目录下，缺少 LocaleEmulator.dll 和 LoaderDll.dll 文件导致的。 您可以通过 Locale Emulator 的作者的 github 页面 取得最新版本的 LE 文件 Zip 压缩文档里面会有这两个 dll 文件，把这两个 dll 文件拷贝到缤放登录器的同一目录，就可以解决此问题 这个问题，我已经向开发者提交解决建议了，当然，如果您使用较旧的版本，依然会面临这个问题。查看提交的 issues 六、网络相关导致的常见问题这里出现的问题，多是由于加速器或者其他网络因素导致的 当然 也有特别例子，如账号服务不存在等情况 6.1、缤放无法获取密码有多种原因会导致这种情况出现： 1、未安装 beanfun 程序，或未连接上程序：没有安装，可以看上一个问题解决方法，如果已经安装未能连接上，可能需要重新安装一次程序看看，如果还不可以，或许是被某些安全软件拦截了。 2、未启用台服冒险岛加速器导致，或网络问题：有些区域，可能需要开启加速器之后，才能正常获取密码，往往先开加速器，还能有效避免锁号问题。 3、2020年5月底因大量工作室涌入导致暂时关闭新号密码获取：这是短期的，等这情况过后，就会恢复。 6.2、缤放无法打开会员中心、充值页面等这也是加速器不支持导致的，建议更换一个加速器，或者不开加速器试试看。 6.3、登入失败，未找到 Eventvalidation 讯息，请检查网络连接如果出现这情况，请留意一下账号安全情况！ 登入状态除非很久，或者更换过节点等操作，正常情况下是：不会执行退出账号行为的！ 那么，您刚登录账号不久，再获取密码就提示这个，应该是有人登录过你的账号了！ 具体登录记录可以从：会员中心-查询记录-大事纪-beanfun!主账号 查询账号登录情况。 6.4、缤放提示：获取密码失败，服务账号不存在之前就有多个萌新深夜去注册账号，无论等待多久都提示：“服务账号不存在”，但是查询账号信息都显示状态正常。 经过多位小伙伴提供的注册时间可以得出：深夜后注册的账号等于空号！这时候您就需要通过 “客服中心” 联系客服，帮忙解决此问题 请大家别在深夜去注册账号。 另外，每次维护时注册的账号也会出现这情况，维护时间多是在星期三，这是由于数据同步不到游戏数据库，这情况就需要等待一天了。 要是等了一天多，还是不行，就需要:联系客服进行账号异常处理 著名服务器卡爆事件也会导致此类情况发生2020年5月底大量工作室进台服，导致服务器卡爆，官方直接把月底几天申请的新号暂停密码取得服务，并且加强在线 GM 在线排查。这时候申请的账号就会获取不到密码。后续会不会再次出现这种情况也很难说，好在这种特殊情况只维持几天。 6.5、获取密码失败，请尝试重新登入。索引和长度必须引用该字符串内的位置。参数名：length这情况多是 beanfun账号注册不久发生的，因为港服的号要同步到台服数据库里，这需要一定的时间，有时遇到数据库维护，就要等多几天了。 太难了。。。 如果是因为这个导致的，持续几天都还是这样，或许你可能需要联系客服或者重新注册一个账号了。 提示如下图： 6.6、台号登录时：请点击我不是机器人这是由于加速器的同一个节点太多人使用，导致需要进行人机验证，这时，就需要您进行更换节点试试看了。 6.7、其他因网络错误导致的提示这些情况都是网络问题导致的，一般换个节点或者更换其他加速器就能解决。 这类错误提示如： 基础连接已经关闭：发送时发生错误 以及其他未列举的提示…. 七、锁号误封或者永久封号的账号无法进入游戏如果账号显示灰色，要么是锁号了，要么是封号了。 请查看原因，可以点 “会员中心” - “查询记录” - “大事件” 里查看。 之前大事件不能查询当天的，最早是昨天的。现在不知道是否可以查询当天的了。 事件显示：帳號鎖定(終止遊戲契約(永久鎖定);0) 出现这情况，会有两种情况，一种是使用非法程序导致永久封号，如：压键盘、使用鼠标连点、外挂程序、购买工作室游戏币，等等。 如果不是上面所说的情况，那么应该是误封了，请申请解锁。如 2020年3月份 有名的大面积永久误封斗燃猫号，只要申请，说明原因，就会得到解锁。 八、多账号管理在缤放登录器的登录界面中，可以点击 “管理账号” 进行账号备注设置，这让可以让您更容易区别出谁的号是那个了： 相关链接第三方缤放登录器：Github 下载页面在线查杀：中文 virscan | 国际英文 virustotalbeanfun官网: 香港橘子官方下载页面NET Framework 运行库: 微软官方下载页面","categories":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"}],"tags":[{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"},{"name":"缤放","slug":"缤放","permalink":"https://xtikas.com/tags/%E7%BC%A4%E6%94%BE/"}]}],"categories":[{"name":"吃瓜","slug":"吃瓜","permalink":"https://xtikas.com/categories/%E5%90%83%E7%93%9C/"},{"name":"教程","slug":"教程","permalink":"https://xtikas.com/categories/%E6%95%99%E7%A8%8B/"},{"name":"职业","slug":"职业","permalink":"https://xtikas.com/categories/%E8%81%8C%E4%B8%9A/"}],"tags":[{"name":"教程","slug":"教程","permalink":"https://xtikas.com/tags/%E6%95%99%E7%A8%8B/"},{"name":"萌新","slug":"萌新","permalink":"https://xtikas.com/tags/%E8%90%8C%E6%96%B0/"},{"name":"职业","slug":"职业","permalink":"https://xtikas.com/tags/%E8%81%8C%E4%B8%9A/"},{"name":"link","slug":"link","permalink":"https://xtikas.com/tags/link/"},{"name":"缤放","slug":"缤放","permalink":"https://xtikas.com/tags/%E7%BC%A4%E6%94%BE/"}]}